var kanji = [
    // #region Minna no Nihongo 0
    { _: "法", K: { のり: "Method, Law" }, O: ["ほう", "ぽう", "はっ", "ふらん"], R: 100, C: ["氵", "去"], T: ["M-0"] },
    { _: "単", K: { ひとえ: "Simple, Single" }, O: ["たん"], R: 586, C: ["小", "田", "十"], T: ["M-0", "N3"] },
    { _: "詞", K: { ことば: "Part of Speech" }, O: ["し"], R: 1636, C: ["言", "司"], T: ["M-0"] },
    // #endregion

    // #region Kanji N5-1
    { _: "一", K: { ひと_つ: "One" }, O: ["いち", "いつ"], R: 2, T: ["N5", "N5-1", "Measures"] },
    { _: "二", K: { ふた_つ: "Two" }, O: ["に"], R: 9, T: ["N5", "N5-1", "Measures"] },
    { _: "三", K: { みっ_つ: "Three" }, O: ["さん", "ぞう"], R: 14, T: ["N5", "N5-1", "Measures"] },
    { _: "四", K: { よっ_つ: "Four" }, O: ["し"], R: 47, T: ["N5", "N5-1", "Measures"] },
    { _: "五", K: { いつ_つ: "Five" }, O: ["ご"], R: 31, T: ["N5", "N5-1", "Measures"] },
    { _: "六", K: { むっ_つ: "Six" }, O: ["ろく"], R: 93, T: ["N5", "N5-1", "Measures"] },
    { _: "七", K: { なな_つ: "Seven" }, O: ["しち"], R: 115, T: ["N5", "N5-1", "Measures"] },
    { _: "八", K: { _: "Divide", や_つ: "Eight", よう: "" }, O: ["はち", "はつ"], R: 92, T: ["N5", "N5-1", "Measures"] },
    { _: "九", K: { ここの_つ: "Nine" }, O: ["きゅう", "く"], R: 55, T: ["N5", "N5-1", "Measures"] },
    { _: "十", K: { _: "Crossed Swords", とお: "Ten" }, O: ["じゅう"], R: 8, T: ["N5", "N5-1", "Measures"] },
    { _: "百", K: { _: "Hundred" }, O: ["ひゃく", "びゃく"], R: 163, C: ["白"], T: ["N5", "N5-1", "Measures"] },
    { _: "千", K: { ち: "Thousand" }, O: ["せん"], R: 195, T: ["N5", "N5-1", "Measures"] },
    { _: "万", K: { _: "Ten Thousand" }, O: ["まん", "ばん"], R: 375, T: ["N5", "N5-1", "Measures"] },
    { _: "円", K: { _: "Yen, Round" }, O: ["えん"], R: 69, T: ["N5", "N5-1", "Measures"] },
    // #endregion

    // #region Kanji N5-2
    { _: "月", K: { つき: "Moon, Month" }, O: ["がつ","げつ"], R: 23, T: ["N5", "N5-2", "Time"] },
    { _: "火", K: { ひ: "Fire" }, O: ["か"], R: 574, C: ["人"], T: ["N5", "N5-2", "Elements"] },
    { _: "水", K: { みず: "Water" }, O: ["すい"], R: 223, T: ["N5", "N5-2", "Elements"] },
    { _: "木", K: { き: "Tree, Wood", こ: "" }, O: ["もく", "ぼく"], R: 317, T: ["N5", "N5-2", "Plants"] },
    { _: "金", K: { かね: "Gold, Metal" }, O: ["きん", "こん"], R: 53, T: ["N5", "N5-2", "Elements"] },
    { _: "土", K: { つち: "Soil, Ground" }, O: ["ど", "と"], R: 307, T: ["N5", "N5-2", "Elements"] },
    { _: "日", K: { ひ: "Day, Sun", び: "", か: "" }, O: ["にち", "じつ"], R: 1, T: ["N5", "N5-2", "Time"] },
    { _: "年", K: { とし: "Year" }, O: ["ねん"], R: 6, T: ["N5", "N5-2", "Time"] },
    // #endregion

    // #region Kanji N5-3
    { _: "人", K: { ひと: "Person, Man", り: "", と: "" }, O: ["じん", "にん"], R: 5, T: ["N5", "N5-3", "Body", "People"] },
    { _: "口", K: { くち: "Mouth, Opening" }, O: ["こう", "く"], R: 284, T: ["N5", "N5-3", "Body"] },
    { _: "目", K: { め: "Eye" }, O: ["もく", "ぼく"], R: 76, T: ["N5", "N5-3", "Body"] },
    { _: "耳", K: { みみ: "Ear" }, O: ["じ"], R: 1328, T: ["N5", "N5-3", "Body"] },
    { _: "手", K: { て: "Hand" }, O: ["しゅ", "ず"], R: 60, T: ["N5", "N5-3", "Body"] },
    { _: "足", K: { あし: "Leg, Foot", た_す: "Add" }, O: ["そく"], R: 343, T: ["N5", "N5-3", "Body"] },
    { _: "力", K: { ちから: "Power, Strength" }, O: ["りょく", "りき"], R: 62, T: ["N5", "N5-3"] },
    { _: "王", K: { おお: "King", わ: "" }, O: ["おう"], R: 684, T: ["N5", "N5-3", "People"] },
    // #endregion

    // #region Kanji N5-4
    { _: "山", K: { やま: "Mountain" }, O: ["さん", "せん"], R: 131, T: ["N5", "N5-4", "Landscape"] },
    { _: "川", K: { かわ: "River", がわ: "" }, O: ["せん"], R: 181, T: ["N5", "N5-4", "Landscape"] },
    { _: "田", K: { た: "Rice Field" }, O: ["でん"], R: 90, T: ["N5", "N5-4", "Landscape"] },
    { _: "石", K: { いし: "Stone" }, O: ["せき", "しゃく", "こく"], R: 342, C: ["口"], T: ["N5", "N5-4", "Elements"] },
    { _: "花", K: { はな: "Flower" }, O: ["か"], R: 578, C: ["艹", "化"], T: ["N5", "N5-4", "Plants"] },
    { _: "竹", K: { _: "Flexibility, Growth, Nature", たけ: "Bamboo" }, O: ["ちく"], R: 593, T: ["N5", "N5-4", "Plants"] },
    { _: "雨", K: { あめ: "Rain" }, O: ["う"], R: 950, T: ["N5", "N5-4", "Weather"] },
    { _: "虫", K: { むし: "Insect" }, O: ["ちゅう", "き"], R: 1351, C: ["中"], T: ["N5", "N5-4", "Animals"] },
    // #endregion

    // #region Kanji N5-5
    { _: "上", K: { うえ: "Up, Above", あ_げる: "Increase, Raise (た)", あ_がる: "Go Up, Rise (じ)", のぼ_る: "Climb, Ascend (じ)", のぼ_せる: "Bring Up (た)", のぼ_り: "Upward" }, O: ["じょう", "しょう"], R: 35, T: ["N5", "N5-5", "Position"] },
    { _: "下", K: { した: "Below", さ_げる: "Lower, Reduce (た)", さ_がる: "Lower, Reduce (じ)", くだ_る: "Descend (じ)", くだ_す: "Issue, Deliver (た)", くだ_り: "Downstream", お_ろす: "Take Down, Withdraw (た)", お_りる: "Go Down, Get Off (じ)" }, O: ["か", "げ"], R: 97, T: ["N5", "N5-5", "Position"] },
    { _: "左", K: { ひだり: "Left" }, O: ["さ", "しゃ"], R: 630, C: ["工"], T: ["N5", "N5-5", "Position"] },
    { _: "右", K: { みぎ: "Right" }, O: ["う", "こう"], R: 602, C: ["口"], T: ["N5", "N5-5", "Position"] },
    { _: "外", K: { そと: "Outside", はず_す: "To Remove (た)", はず_れる: "To Come Off (じ)" }, O: ["がい", "げ"], R: 81, C: ["夕"], T: ["N5", "N5-5", "Position"] },
    { _: "内", K: { うち: "Inside" }, O: ["ない", "だい"], R: 44, C: ["冂", "人"], T: ["N5", "N5-5", "Position"] },
    { _: "中", K: { なか: "Middle" }, O: ["ちゅう"], R: 11, T: ["N5", "N5-5", "Position"] },
    // #endregion

    // #region Kanji N5-6
    { _: "学", K: { まな_ぶ: "Learn" }, O: ["がく"], R: 63, C: ["龸", "子"], T: ["N5", "N5-6", "Academic"] },
    { _: "校", K: { _: "School" }, O: ["こう"], R: 294, C: ["木", "亠", "父"], T: ["N5", "N5-6", "Academic", "Places"] },
    { _: "先", K: { さき: "Before, Previous", ま_ず: "First of all," }, O: ["せん"], R: 173, C: ["儿"], T: ["N5", "N5-6", "Position"] },
    { _: "生", K: { い_きる: "Live", い_ける: "Living", い_かす: "Make Use Of", う_まれる: "Born", な_る: "", う_む: "Give Birth", は_える: "Grow", なま: "Raw",  }, O: ["せい", "しょう"], R: 29, T: ["N5", "N5-6"] },
    { _: "名", K: { な: "Name, Reputation" }, O: ["めい", "みょう"], R: 177, C: ["", "口"], T: ["M-0", "N5", "N5-6"] },
    { _: "字", K: { _: "Character" }, O: ["じ"], R: 485, C: ["宀", "子"], T: ["N5", "N5-6", "Academic"] },
    { _: "本", K: { もと: "Book, Origin" }, O: ["ほん"], R: 10, C: ["木"], T: ["N5", "N5-6", "Objects"] },
    { _: "休", K: { やす_む: "Take a Break", やす_まる: "Rest (じ)", やす_める: "Rest (た)" }, O: ["きゅう"], R: 642, C: ["人", "木"], T: ["N5", "N5-6"] },
    // #endregion

    // #region Kanji N5-7
    { _: "大", K: { おお: "Large, Big", おお_きい: "", おお_いに: "" }, O: ["だい", "たい"], R: 7, T: ["N5", "N5-7", "Measures"] },
    { _: "小", K: { ちい_さい: "Little, Small", こ: "", お: "", さ: "" }, O: ["しょう"], R: 114, T: ["N5", "N5-7", "Measures"] },
    { _: "高", K: { たか_い: "Tall, High, Expensive", たか_める: "Raise, Elevate (た)", たか_まる: "Highten, Intensify (じ)" }, O: ["こう"], R: 65, C: ["亠", "冂", "口"], T: ["N5", "N5-7", "Measures"] },
    { _: "友", K: { とも: "Friend" }, O: ["ゆう"], R: 622, C: ["又"], T: ["N5", "N5-7", "People"] },
    { _: "入", K: { はい_る: "Enter", い_れる: "Put In" }, O: ["にゅう"], R: 56, T: ["N5", "N5-7", "Movement"] },
    { _: "出", K: { で_る: "Go Out", だ_す: "Put Out" }, O: ["しゅつ"], R: 13, C: ["山"], T: ["N5", "N5-7", "Movement"] },
    { _: "門", K: { かど: "Gate" }, O: ["もん"], R: 452, T: ["N5", "N5-7"] },
    { _: "体", K: { からだ: "Body" }, O: ["たい", "てい"], R: 88, C: ["人", "本"], T: ["N5", "N5-7", "Body"] },
    // #endregion

    // #region Kanji N5-8
    { _: "父", K: { ちち: "Father" }, O: ["ふ"], R: 646, T: ["N5", "N5-8", "People"] },
    { _: "母", K: { はは: "Mother" }, O: ["ぼ"], R: 570, T: ["N5", "N5-8", "People"] },
    { _: "子", K: { こ: "Child" }, O: ["し"], R: 72, T: ["N5", "N5-8", "People"] },
    { _: "男", K: { おとこ: "Male" }, O: ["だん", "なん"], R: 240, C: ["田", "力"], T: ["N5", "N5-8", "People"] },
    { _: "女", K: { おんな: "Female", め: "" }, O: ["じょ", "にょ"], R: 151, T: ["N5", "N5-8", "People"] },
    { _: "犬", K: { いぬ: "Dog" }, O: ["けん"], R: 1326, C: ["大"], T: ["N5", "N5-8", "Animals"] },
    // #endregion

    // #region Kanji N5-9
    { _: "立", K: { た_つ: "Stand", た_ち: "", た_てる: "" }, O: ["りつ", "りゅう", "りっとつ"], R: 58, T: ["N5", "N5-9", "Movement"] },
    { _: "見", K: { み_る: "See", み_える: "Appear", み_せる: "Show" }, O: ["けん"], R: 22, C: ["目", "儿"], T: ["N5", "N5-9"] },
    { _: "聞", K: { き_く: "Hear, Ask" }, O: ["ぶん"], R: 319, C: ["門", "耳"], T: ["N5", "N5-9"] },
    { _: "行", K: { い_く: "Go" }, O: ["こう"], R: 20, C: ["彳"], T: ["N5", "N5-9", "Movement"] },
    { _: "来", K: { く_る: "Come" }, O: ["らい"], R: 102, T: ["N5", "N5-9", "Movement"] },
    { _: "帰", K: { かえ_る: "Go Home" }, O: ["き"], R: 504, C: ["刀", "帚"], T: ["N5", "N5-9", "Movement"] },
    // #endregion

    // #region Kanji N5-10
    { _: "米", K: { こめ: "Rice", よね: "" }, O: ["べい", "まい"], R: 61, T: ["N5", "N5-10", "Plants"] },
    { _: "茶", K: { _: "Tea" }, O: ["ちゃ"], R: 1116, C: ["艹"], T: ["N5", "N5-10", "Plants"] },
    { _: "牛", K: { うし: "Cow" }, O: ["ぎゅう"], R: 1202, T: ["N5", "N5-10", "Animals"] },
    { _: "肉", K: { _: "Meat" }, O: ["にく"], R: 986, C: ["内", "人"], T: ["N5", "N5-10"] },
    { _: "魚", K: { さかな: "Fish", うお: "" }, O: ["ぎょ"], R: 1208, C: ["火"], T: ["N5", "N5-10", "Animals"] },
    { _: "貝", K: { _: "Value, Trade", かい: "Shellfish" }, O: ["ばい"], R: 1787, C: ["目", "八"], T: ["N5", "N5-10", "Animals"] },
    { _: "好", K: { す_き: "Like" }, O: ["こう"], R: 423, C: ["女", "子"], T: ["N5", "N5-10"] },
    { _: "物", K: { もの: "Thing" }, O: ["ぶつ", "もつ"], R: 215, T: ["N5", "N5-10", "Objects"] },
    // #endregion

    // #region Kanji N5-11
    { _: "時", K: { とき: "Time, Hour" }, O: ["じ"], R: 16, C: ["日", "寺"], T: ["N5", "N5-11", "Time"] },
    { _: "間", K: { あいだ: "Interval" }, O: ["かん", "けん", "ま"], R: 33, C: ["門", "日"], T: ["N5", "N5-11", "Time"] },
    { _: "半", K: { _: "Half" }, O: ["はん"], R: 224, T: ["N5", "N5-11", "Measures"] },
    { _: "分", K: { _: "Minute, Segment", わ_ける: "Divide" }, O: ["ぶん"], R: 24, C: ["八", "刀"], T: ["N5", "N5-11", "Time"] },
    { _: "今", K: { いま: "Now" }, O: ["こん"], R: 49, T: ["N5", "N5-11", "Time"] },
    { _: "何", K: { なに: "What?" }, O: ["か"], R: 340, C: ["人", "可"], T: ["N5", "N5-11", "Abstract"] },
    { _: "夕", K: { ゆう: "Evening" }, O: ["せき"], R: 924, T: ["N5", "N5-11", "Time"] },
    { _: "方", K: { かた: "Direction, Person" }, O: ["ほう", "ぽう"], R: 46, T: ["N5", "N5-11"] },
    // #endregion

    // #region Kanji N5-12
    { _: "林", K: { はやし: "Grove, Forest" }, O: ["りん"], R: 656, C: ["木"], T: ["N5", "N5-12", "Landscape"] },
    { _: "森", K: { もり: "Forest" }, O: ["しん"], R: 609, C: ["木"], T: ["N5", "N5-12", "Landscape"] },
    { _: "畑", K: { はたけ: "Farm, Field" }, R: 1176, C: ["火", "田"], T: ["N5", "N5-12", "Landscape"] },
    { _: "岩", K: { いわ: "Boulder, Cliff" }, O: ["がん"], R: 787, C: ["山", "石"], T: ["N5", "N5-12"] },
    { _: "音", K: { おと: "Sound", ね: "" }, O: ["おん", "いん"], R: 491, C: ["立", "日"], T: ["M-0", "N5", "N5-12"] },
    { _: "明", K: { あ_かり: "Lamp", あか_るい: "Bright", あか_るむ: "Brighten", あか_らむ: "Blush", あき_らか: "Clear, Obvious" }, O: ["めい"], R: 67, C: ["日", "月"], T: ["N5", "N5-12"] },
    { _: "暗", K: { くら_い: "Dark" }, O: ["あん"], R: 1040, C: ["日", "音"], T: ["N5", "N5-12"] },
    // #endregion
    
    // #region Kanji N5-13
    { _: "言", K: { い_う: "Say", こと: "Word" }, O: ["げん", "ごん"], R: 83, C: ["口"], T: ["N5", "N5-13"] },
    { _: "書", K: { か_く: "Write" }, O: ["しょ"], R: 169, C: ["日"], T: ["N5", "N5-13"] },
    { _: "読", K: { よ_む: "Read" }, O: ["どく", "とく", "とう"], R: 618, C: ["言", "売"], T: ["N5", "N5-13"] },
    { _: "話", K: { はな_す: "Talk", はなし: "Story" }, O: ["わ"], R: 134, C: ["言", "舌"], T: ["N5", "N5-13"] },
    { _: "食", K: { た_べる: "Eat" }, O: ["しょく"], R: 328, T: ["N5", "N5-13"] },
    { _: "飲", K: { の_む: "Drink" }, O: ["いん"], R: 969, C: ["食", "欠"], T: ["N5", "N5-13"] },
    { _: "買", K: { か_う: "Buy" }, O: ["ばい"], R: 520, C: ["罒", "貝"], T: ["N5", "N5-13"] },
    // #endregion
    
    // #region Kanji N5-14
    { _: "町", K: { まち: "Town" }, O: ["ちょう"], R: 0, C: ["田"], T: ["N5", "N5-14", "Places"] },
    { _: "寺", K: { てら: "Temple" }, O: ["じ"], R: 879, C: ["土", "寸"], T: ["N5", "N5-14", "Places"] },
    { _: "電", K: { _: "Electricity" }, O: ["でん"], R: 268, C: ["雨"], T: ["N5", "N5-14", "Elements"] },
    { _: "車", K: { くるま: "Car" }, O: ["しゃ"], R: 333, T: ["N5", "N5-14", "Objects"] },
    { _: "東", K: { ひがし: "East" }, O: ["とう"], R: 37, C: ["日", "木"], T: ["N5", "N5-14", "Position"] },
    { _: "西", K: { にし: "West" }, O: ["せい", "さい", "す"], R: 259, T: ["N5", "N5-14", "Position"] },
    { _: "北", K: { きた: "North" }, O: ["ほく"], R: 153, T: ["N5", "N5-14", "Position"] },
    { _: "南", K: { みなみ: "South" }, O: ["なん"], R: 341, T: ["N5", "N5-14", "Position"] },
    // #endregion
    
    // #region Kanji N5-15
    { _: "新", K: { あたら_しい: "New" }, O: ["しん"], R: 51, C: ["立", "木", "斤"], T: ["N5", "N5-15"] },
    { _: "古", K: { ふる_い: "Old" }, O: ["こ"], R: 509, C: ["十", "口"], T: ["N5", "N5-15"] },
    { _: "長", K: { _: "Superior", なが_い: "Long" }, O: ["ちょう"], R: 12, T: ["N5", "N5-15"] },
    { _: "安", K: { やす_い: "Cheap" }, O: ["あん"], R: 144, C: ["宀", "女"], T: ["N5", "N5-15"] },
    { _: "多", K: { おお_い: "Many, Frequent" }, O: ["た"], R: 139, C: ["夕"], T: ["N5", "N5-15"] },
    { _: "少", K: { すこ_し: "Few", すく_ない: "" }, O: ["しょう"], R: 287, C: ["小"], T: ["N5", "N5-15"] },
    { _: "元", K: { もと: "Beginning, Origin" }, O: ["げん", "がん"], R: 192, T: ["N5", "N5-15", "Abstract"] },
    { _: "気", K: { き: "Feeling, Spirit, Mood" }, O: ["け"], R: 113, T: ["N5", "N5-15", "Abstract"] },
    // #endregion

    // #region Kanji N4-1
    { _: "家", K: { いえ: "House, Family", うち: "", や: "Professional, Expert" }, O: ["か", "け"], R: 133, C: ["宀", "豕"], T: ["N4", "N4-1"] },
    { _: "族", K: { つぎ: "Tribe, Family" }, O: ["ぞく"], R: 393, C: ["方", "矢"], T: ["N4", "N4-1"] },
    { _: "兄", K: { あに: "Older Brother" }, O: ["けい", "きょう"], R: 1219, C: ["口", "儿"], T: ["N4", "N4-1"] },
    { _: "弟", K: { おとうと: "Younger Brother" }, O: ["てい", "だい"], R: 1161, C: ["弓"], T: ["N4", "N4-1"] },
    { _: "姉", K: { あね: "Older Sister" }, O: ["し"], R: 1473, C: ["女", "市"], T: ["N4", "N4-1"] },
    { _: "妹", K: { いもうと: "Younger Sister" }, O: ["まい"], R: 1446, C: ["女", "未"], T: ["N4", "N4-1"] },
    { _: "私", K: { わたし: "I, Me" }, O: ["し"], R: 242, C: ["禾", "厶"], T: ["N4", "N4-1"] },
    { _: "育", K: { そだ_つ: "Grow Up", そだ_てる: "Raise" }, O: ["いく"], R: 369, C: ["厶", "月"], T: ["N4", "N4-1"] },
    
    { _: "部", K: { へ: "Section, Department" }, O: ["ぶ"], R: 36, C: ["立", "口", "⻏"], T: ["N4", "N4-1"] },
    { _: "屋", K: { や: "Roof, House, Shop" }, O: ["おく"], R: 616, C: ["尸", "至"], T: ["N4", "N4-1"] },
    { _: "広", K: { ひろ_い: "Wide, Spacious", ひろ_まる: "Get Wider", ひろ_める: "Make Wider", ひろ_がる: "Spread", ひろ_げる: "" }, O: ["こう"], R: 263, C: ["广", "厶"], T: ["N4", "N4-1"] },
    { _: "低", K: { ひく_い: "Lower, Short", ひく_まる: "Get Lower", ひく_める: "Make Lower" }, O: ["てい"], R: 435, C: ["人", "氏"], T: ["N4", "N4-1"] },
    { _: "近", K: { ちか_い: "Nearby, Early" }, O: ["きん", "こん"], R: 194, C: ["⻌", "斤"], T: ["N4", "N4-1"] },
    { _: "遠", K: { とお_い: "Distant" }, O: ["えん", "おん"], R: 887, C: ["⻌", "土"], T: ["N4", "N4-1"] },
    { _: "静", K: { しず_か: "Quiet", しず_まる: "Get Quiet", しず_める: "Make Quiet" }, O: ["せい", "じょう"], R: 764, C: ["青", "争"], T: ["N4", "N4-1"] },

    { _: "洋", K: { _: "Western Style" }, O: ["よう"], R: 763, C: ["氵", "羊"], T: ["N4", "N4-1"] },
    { _: "服", K: { _: "Clothing" }, O: ["ふく"], R: 873, C: ["月", "卩", "又"], T: ["N4", "N4-1"] },
    { _: "短", K: { みじか_い: "Short, Defect" }, O: ["たん"], R: 689, C: ["矢", "豆"], T: ["N4", "N4-1"] },
    { _: "玉", K: { たま: "Ball, Jewel" }, O: ["ぎょく"], R: 737, C: ["王"], T: ["N4", "N4-1"] },
    { _: "毛", K: { け: "Hair, Fur" }, O: ["もう"], R: 1179, T: ["N4", "N4-1"] },
    { _: "糸", K: { いと: "Thread" }, O: ["し"], R: 1488, C: ["幺", "小"], T: ["N4", "N4-1"] },
    { _: "光", K: { ひか_る: "Shine", ひかり: "Light" }, O: ["こう"], R: 527, C: ["小"], T: ["N4", "N4-1"] },
    { _: "衣", K: { ころも: "Garment" }, O: ["い"], R: 1214, T: ["N4", "N4-1"] },
    // #endregion

    // #region Kanji N4-2
    { _: "店", K: { みせ: "Store, Shop" }, O: ["てん"], R: 378, C: ["广", "占"], T: ["N4", "N4-2"] },
    { _: "客", K: { _: "Guest, Customer" }, O: ["きゃく", "かく"], R: 557, C: ["宀", "夂", "口"], T: ["N4", "N4-2"] },
    { _: "親", K: { おや: "Parent", した_しい: "Close, Intimate", した_しむ: "Become Familiar With" }, O: ["しん"], R: 406, C: ["立", "木", "見"], T: ["N4", "N4-2"] },
    { _: "切", K: { き_る: "Cut" }, O: ["せつ"], R: 324, C: ["刀"], T: ["N4", "N4-2"] },
    { _: "売", K: { う_る: "Sell" }, O: ["ばい"], R: 202, C: ["士"], T: ["N4", "N4-2"] },
    { _: "当", K: { あ_たる: "Be Hit", あ_てる: "Hit", あ_たり: "Win" }, O: ["とう"], R: 91, C: ["小", "彐"], T: ["N4", "N4-2"] },
    { _: "品", K: { しな: "Product" }, O: ["ひん"], R: 225, C: ["口"], T: ["N4", "N4-2"] },
    
    { _: "便", K: { _: "Convenience", たよ_り: "Tidings, News" }, O: ["べん", "びん"], R: 729, C: ["人", "更"], T: ["N4", "N4-2"] },
    { _: "利", K: { き_く: "Useful" }, O: ["り"], R: 203, C: ["禾", "刀"], T: ["N4", "N4-2"] },
    { _: "使", K: { つか_う: "Use" }, O: ["し"], R: 219, C: ["人"], T: ["N4", "N4-2"] },
    { _: "銀", K: { しろがね: "Silver" }, O: ["ぎん"], R: 395, C: ["金", "艮"], T: ["N4", "N4-2"] },
    { _: "白", K: { しろ_い: "White" }, O: ["はく", "びゃく"], R: 483, T: ["N4", "N4-2"] },
    { _: "黒", K: { くろ_い: "Black" }, O: ["こく"], R: 573, C: ["里", "火"], T: ["N4", "N4-2"] },
    { _: "紙", K: { かみ: "Paper" }, O: ["し"], R: 559, C: ["糸", "氏"], T: ["N4", "N4-2"] },
    
    { _: "朝", K: { あさ: "Morning" }, O: ["ちょう"], R: 248, C: ["早", "月"], T: ["N4", "N4-2"] },
    { _: "晩", K: { _: "Nightfall" }, O: ["ばん"], R: 1424, C: ["日", "免"], T: ["N4", "N4-2"] },
    { _: "昼", K: { ひる: "Daytime" }, O: ["ちゅう"], R: 1115, C: ["尺", "日"], T: ["N4", "N4-2"] },
    { _: "夜", K: { よる: "Nighttime", よ: "" }, O: ["や"], R: 487, C: ["人", "夕"], T: ["N4", "N4-2"] },
    { _: "前", K: { まえ: "Before, In Front" }, O: ["ぜん"], R: 27, C: ["艹", "月", "刀"], T: ["N4", "N4-2"] },
    { _: "後", K: { あと: "After", うしろ: "Back, Behind", おく_れる: "Fall Behind" }, O: ["ご", "こう"], R: 26, C: ["彳", "幺", "夂"], T: ["N4", "N4-2"] },
    { _: "午", K: { _: "Noon" }, O: ["ご"], R: 154, T: ["N4", "N4-2"] },
    { _: "早", K: { はや_い: "Early, Quickly" }, O: ["そう"], R: 402, C: ["日", "十"], T: ["N4", "N4-2"] },
    // #endregion
    
    // #region Kanji N4-3
    { _: "荷", K: { に: "Baggage, Cargo" }, O: ["か"], R: 1230, C: ["艹", "何"], T: ["N4", "N4-3"] },
    { _: "送", K: { おく_る: "Send, Escort" }, O: ["そう"], R: 311, C: ["⻌", "关"], T: ["N4", "N4-3"] },
    { _: "宅", K: { _: "Home, Residence" }, O: ["たく"], R: 357, T: ["N4", "N4-3"] },
    { _: "急", K: { いそ_ぐ: "Hurry" }, O: ["きゅう"], R: 309, C: ["心"], T: ["N4", "N4-3"] },
    { _: "速", K: { はや_い: "Fast", はや_める: "Speed Up" }, O: ["そく"], R: 576, C: ["⻌", "束"], T: ["N4", "N4-3"] },
    { _: "遅", K: { おそ_い: "Slow, Late", おく_れる: "Be Delayed", おく_らす: "Postpone" }, O: ["ち"], R: 833, C: ["⻌", "尸", "羊"], T: ["N4", "N4-3"] },
    { _: "重", K: { おも_い: "Heavy, Important", おも_り: "Weight", かさ_なる: "Overlap", かさ_ねる: "Layer" }, O: ["じゅう", "ちょう"], R: 193, T: ["N4", "N4-3"] },
    { _: "軽", K: { かる_い: "Lightweight, Unimportant", かろ_やか: "" }, O: ["けい", "きょう", "きん"], R: 790, C: ["車", "又", "土"], T: ["N4", "N4-3"] },

    { _: "住", K: { す_む: "Reside" }, O: ["じゅう"], R: 270, C: ["人", "王"], T: ["N4", "N4-3"] },
    { _: "所", K: { ところ: "Place" }, O: ["しょ"], R: 221, C: ["戸", "斤"], T: ["N4", "N4-3"] },
    { _: "様", K: { さま: "Mister" }, O: ["よう"], R: 493, C: ["木", "羊", "水"], T: ["N4", "N4-3"] },
    { _: "主", K: { ぬし: "Lord", おも: "Main" }, O: ["しゅ"], R: 95, C: ["王"], T: ["N4", "N4-3"] },
    { _: "番", K: { _: "Number in a Series" }, O: ["ばん"], R: 348, C: ["釆", "田"], T: ["N4", "N4-3"] },
    { _: "地", K: { _: "Ground, Land" }, O: ["ち"], R: 40, C: ["土"], T: ["N4", "N4-3"] },
    { _: "号", K: { _: "Number, Edition" }, O: ["ごう"], R: 585, C: ["口"], T: ["N4", "N4-3"] },
    { _: "京", K: { _: "Capital" }, O: ["きょう"], R: 74, C: ["口", "小"], T: ["N4", "N4-3"] },
    
    { _: "国", K: { くに: "Country" }, O: ["こく"], R: 3, C: ["王"], T: ["N4", "N4-3"] },
    { _: "都", K: { みやこ: "Metropolis" }, O: ["と"], R: 123, C: ["者", "⻏"], T: ["N4", "N4-3"] },
    { _: "道", K: { みち: "Road" }, O: ["どう"], R: 207, C: ["⻌", "首"], T: ["N4", "N4-3"] },
    { _: "府", K: { _: "Urban Prefecture" }, O: ["ふ"], R: 170, C: ["广", "人", "寸"], T: ["N4", "N4-3"] },
    { _: "県", K: { _: "Prefecture" }, O: ["けん"], R: 140, C: ["目"], T: ["N4", "N4-3"] },
    { _: "市", K: { いち: "Market, City" }, O: ["し"], R: 42, T: ["N4", "N4-3"] },
    { _: "区", K: { _: "Ward, District" }, O: ["く"], R: 137, T: ["N4", "N4-3"] },
    { _: "村", K: { むら: "Village, Town" }, O: ["そん"], R: 253, C: ["木", "寸"], T: ["N4", "N4-3"] },
    // #endregion
    
    // #region Kanji N4-4
    { _: "毎", K: { _: "Every" }, O: ["まい"], R: 436, T: ["N4", "N4-4"] },
    { _: "週", K: { _: "Week" }, O: ["しゅう"], R: 540, C: ["⻌", "周"], T: ["N4", "N4-4"] },
    { _: "映", K: { うつ_る: "Reflect", うつ_す: "Project" }, O: ["えい"], R: 404, C: ["日", "央"], T: ["N4", "N4-4"] },
    { _: "画", K: { _: "Brush-Stroke, Image", えが_く: "Draw" }, O: ["が", "かく"], R: 199, T: ["N4", "N4-4"] },
    { _: "館", K: { _: "Large Building, Palace", やかた: "Museum" }, O: ["かん"], R: 613, C: ["食", "官"], T: ["N4", "N4-4"] },
    { _: "公", K: { おおやけ: "Public, Official" }, O: ["こう"], R: 118, C: ["八", "厶"], T: ["N4", "N4-4"] },
    { _: "園", K: { _: "Park, Garden, Yard" }, O: ["えん"], R: 628, C: ["口", "土"], T: ["N4", "N4-4"] },
    
    { _: "夫", K: { おっと: "Husband" }, O: ["ふ", "ふう"], R: 335, C: ["大"], T: ["N4", "N4-4"] },
    { _: "妻", K: { つま: "Wife" }, O: ["さい"], R: 691, C: ["女"], T: ["N4", "N4-4"] },
    { _: "特", K: { _: "Special" }, O: ["とく"], R: 234, C: ["牛", "寺"], T: ["N4", "N4-4"] },
    { _: "思", K: { おも_う: "Think" }, O: ["し"], R: 132, C: ["田", "心"], T: ["N4", "N4-4"] },
    { _: "料", K: { _: "Fee, Materials" }, O: ["りょう"], R: 295, C: ["米", "斗"], T: ["N4", "N4-4"] },
    { _: "理", K: { _: "Logic, Arrangement" }, O: ["り"], R: 86, C: ["王", "里"], T: ["N4", "N4-4"] },
    { _: "有", K: { _: "Famous", あ_る: "Possess, Exist" }, O: ["ゆう"], R: 282, C: ["月"], T: ["N4", "N4-4"] },
    
    { _: "会", K: { あ_う: "Meet" }, O: ["かい"], R: 4, C: ["厶"], T: ["N4", "N4-4"] },
    { _: "社", K: { _: "Company, Association" }, O: ["しゃ"], R: 21, C: ["礻", "土"], T: ["N4", "N4-4"] },
    { _: "働", K: { はたら_く: "Work" }, O: ["どう"], R: 417, C: ["人", "動"], T: ["N4", "N4-4"] },
    { _: "作", K: { つく_る: "Make" }, O: ["さく", "さ"], R: 103, C: ["人", "乍"], T: ["N4", "N4-4"] },
    { _: "工", K: { もく: "Craft, Construction" }, O: ["こう", "く"], R: 299, T: ["N4", "N4-4"] },
    { _: "場", K: { ば: "Location, Place" }, O: ["じょう"], R: 52, C: ["土", "昜"], T: ["N4", "N4-4"] },
    { _: "始", K: { はじ_まる: "Begin (じ)", はじ_める: "Start (た)" }, O: ["し"], R: 244, C: ["女", "台"], T: ["N4", "N4-4"] },
    { _: "終", K: { お_わる: "Be Over (じ)", お_える: "Finish (た)", つい: "End", つい_に: "Finally" }, O: ["しゅう"], R: 256, C: ["糸", "夂", "冫"], T: ["N4", "N4-4"] },
    // #endregion

    // #region Kanji N4-5
    { _: "駅", K: { _: "Station" }, O: ["えき"], R: 724, C: ["馬", "尺"], T: ["N4", "N4-5"] },
    { _: "鉄", K: { _: "Iron" }, O: ["てつ"], R: 672, C: ["金", "失"], T: ["N4", "N4-5"] },
    { _: "乗", K: { の_る: "Get On, Ride", の_せる: "Put On, Load" }, O: ["じょう"], R: 377, T: ["N4", "N4-5"] },
    { _: "降", K: { お_りる: "Get Off", お_ろす: "Take Off, Unload", ふ_る: "Fall" }, O: ["こう", "ご"], R: 596, C: ["⻏", "夂"], T: ["N4", "N4-5"] },
    { _: "開", K: { ひら_く: "Be Open", あ_く: "",  ひら_き: "Opening", ひら_ける: "To Open", あ_ける: "" }, O: ["かい"], R: 59, C: ["門"], T: ["N4", "N4-5"] },
    { _: "閉", K: { し_まる: "Be Closed", と_じる: "", し_める: "To Close", と_ざす: "" }, O: ["へい"], R: 951, C: ["門"], T: ["N4", "N4-5"] },
    { _: "発", K: { た_つ: "Depart", あば_く: "", つか_わす: "Emit" }, O: ["はつ", "ほつ"], R: 32, C: ["癶", "儿"], T: ["N4", "N4-5", "M-0"] },
    { _: "着", K: { き_る: "Wear", き_せる: "Put On", つ_く: "Arrive" }, O: ["ちゃく"], R: 376, C: ["艹", "王", "目"], T: ["N4", "N4-5"] },
    
    { _: "交", K: { まじ_わる: "Intersect", まじ_える: "", ま_ざる: "Mix", ま_ぜる: "" }, O: ["こう"], R: 178, C: ["亠", "父"], T: ["N4", "N4-5"] },
    { _: "通", K: { とお_る: "Go Through", とお_り: "Street", とお_す: "Pass", とお_し: "Through", かよ_う: "Commute, Attend" }, O: ["つう"], R: 80, C: ["⻌", "用"], T: ["N4", "N4-5"] },
    { _: "台", K: { _: "Unit, Machine Counter" }, O: ["だい", "たい"], R: 262, C: ["厶", "口"], T: ["N4", "N4-5"] },
    { _: "止", K: { と_まる: "Be Stopped", と_める: "Stop" }, O: ["し"], R: 310, T: ["N4", "N4-5"] },
    { _: "色", K: { いろ: "Color" }, O: ["しょく"], R: 621, T: ["N4", "N4-5"] },
    { _: "赤", K: { あか_い: "Red" }, O: ["せき"], R: 584, T: ["N4", "N4-5"] },
    { _: "黄", K: { き: "Yellow" }, O: ["おう"], R: 1240, T: ["N4", "N4-5"] },
    { _: "青", K: { あお_い: "Blue" }, O: ["せい", "しょう"], R: 589, C: ["月"], T: ["N4", "N4-5"] },
    
    { _: "病", K: { や_む: "Get Sick" }, O: ["びょう"], R: 384, C: ["疒"], T: ["N4", "N4-5"] },
    { _: "院", K: { _: "Institution" }, O: ["いん"], R: 150, C: ["⻏", "宀", "兀"], T: ["N4", "N4-5"] },
    { _: "医", K: { _: "Doctor, Medicine" }, O: ["い"], R: 437, C: ["矢"], T: ["N4", "N4-5"] },
    { _: "科", K: { _: "Department, Section" }, O: ["か"], R: 531, C: ["禾", "斗"], T: ["N4", "N4-5"] },
    { _: "薬", K: { くすり: "Medicine, Chemical" }, O: ["やく"], R: 702, C: ["艹", "楽"], T: ["N4", "N4-5"] },
    { _: "待", K: { ま_つ: "Wait" }, O: ["たい"], R: 391, C: ["彳", "寺"], T: ["N4", "N4-5"] },
    { _: "合", K: { あ_う: "Fit", あ_い: "Match", あ_わす: "Combine", あ_わせる: "Fit Together" }, O: ["ごう"], R: 41, C: ["口"], T: ["N4", "N4-5"] },
    { _: "計", K: { はか_る: "Measure", はか_らう: "Plan" }, O: ["けい"], R: 228, C: ["言", "十"], T: ["N4", "N4-5"] },
    // #endregion

    // #region Kanji N4-6
    { _: "研", K: { _: "Polish", と_ぐ: "Sharpen" }, O: ["けん"], R: 336, C: ["石", "廾"], T: ["N4", "N4-6"] },
    { _: "究", K: { _: "Research", きわ_める: "Study" }, O: ["きゅう", "く"], R: 368, C: ["穴", "九"], T: ["N4", "N4-6"] },
    { _: "文", K: { _: "Sentence, Literature", ふみ: "", あや: "" }, O: ["ぶん", "もん"], R: 190, T: ["N4", "N4-6", "M-0"] },
    { _: "語", K: { _: "Language", かた_る: "Talk", かた_らう: "" }, O: ["ご"], R: 301, C: ["言", "五"], T: ["N4", "N4-6", "M-0"] },
    { _: "英", K: { はなぶさ: "English, Hero" }, O: ["えい"], R: 430, C: ["艹", "大"], T: ["N4", "N4-6"] },
    { _: "化", K: { ば_ける: "Disguise", か_する: "Convert Into" }, O: ["か", "け"], R: 89, C: ["人", "匕"], T: ["N4", "N4-6"] },
    { _: "数", K: { かず: "Number", かぞ_える: "Count" }, O: ["すう"], R: 148, C: ["米", "女", "攵"], T: ["N4", "N4-6"] },
    { _: "心", K: { こころ: "Heart, Spirit" }, O: ["しん"], R: 157, T: ["N4", "N4-6"] },

    { _: "若", K: { わか_い: "Young" }, O: ["しゃく"], R: 458, C: ["艹", "右"], T: ["N4", "N4-6"] },
    { _: "集", K: { あつ_まる: "Get Together", あつ_める: "Collect", つど_う: "Gather" }, O: ["しゅう"], R: 210, C: ["隹", "木"], T: ["N4", "N4-6"] },
    { _: "知", K: { し_る: "Know", し_らせる: "Inform" }, O: ["ち"], R: 205, C: ["矢", "口"], T: ["N4", "N4-6"] },
    { _: "酒", K: { さけ: "Alcohol", さか: "" }, O: ["しゅ"], R: 1006, C: ["氵"], T: ["N4", "N4-6"] },
    { _: "歌", K: { うた_う: "Sing" }, O: ["か"], R: 519, C: ["可", "欠"], T: ["N4", "N4-6"] },
    { _: "声", K: { こえ: "Voice", こわ: "" }, O: ["せい", "しょう"], R: 388, C: ["士", "尸"], T: ["N4", "N4-6"] },
    { _: "楽", K: { たの_しい: "Fun", たの_しむ: "Enjoy" }, O: ["がく", "らく"], R: 373, C: ["冫", "白", "木"], T: ["N4", "N4-6"] },

    { _: "味", K: { あじ: "Taste, Flavor", あじ_わう: "" }, O: ["み"], R: 442, C: ["口", "未"], T: ["N4", "N4-6"] },
    { _: "油", K: { あぶら: "Oil" }, O: ["ゆ", "ゆう"], R: 690, C: ["氵", "由"], T: ["N4", "N4-6"] },
    { _: "太", K: { ふと_い: "Thick", ふと_る: "Gain Weight" }, O: ["たい", "た"], R: 552, C: ["大"], T: ["N4", "N4-6"] },
    { _: "細", K: { ほそ_い: "Thin", ほそ_る: "Get Thinner", こま_かい: "Fine" }, O: ["さい"], R: 537, C: ["糸", "田"], T: ["N4", "N4-6"] },
    { _: "皿", K: { さら: "Dish, Plate" }, O: ["べい"], R: 1812, T: ["N4", "N4-6"] },
    { _: "飯", K: { めし: "Meal" }, O: ["はん"], R: 1046, C: ["食", "又"], T: ["N4", "N4-6"] },
    { _: "麦", K: { むぎ: "Wheat, Barley" }, O: ["ばく"], R: 1615, C: ["夂"], T: ["N4", "N4-6"] },
    // #endregion

    // #region Kanji N4-7
    { _: "春", K: { はる: "Spring" }, O: ["しゅん"], R: 579, C: ["日"], T: ["N4", "N4-7"] },
    { _: "夏", K: { なつ: "Summer" }, O: ["か"], R: 659, C: ["夂"], T: ["N4", "N4-7"] },
    { _: "秋", K: { あき: "Autumn", とき: "" }, O: ["しゅう"], R: 635, C: ["禾", "火"], T: ["N4", "N4-7"] },
    { _: "冬", K: { ふゆ: "Winter" }, O: ["とう"], R: 1090, C: ["夂", "冫"], T: ["N4", "N4-7"] },
    { _: "空", K: { そら: "Sky", あ_く: "Vacant", あ_き: "", あ_ける: "", から: "Emptiness" }, O: ["くう"], R: 304, C: ["穴", "工"], T: ["N4", "N4-7"] },
    { _: "星", K: { ほし: "Star" }, O: ["せい", "しょう"], R: 844, C: ["日", "生"], T: ["N4", "N4-7"] },
    { _: "雲", K: { くも: "Cloud" }, O: ["うん"], R: 1256, C: ["雨", "云"], T: ["N4", "N4-7"] },
    { _: "去", K: { さ_る: "Leave, Depart" }, O: ["きょ", "こ"], R: 440, C: ["土", "厶"], T: ["N4", "N4-7"] },

    { _: "天", K: { あまつ: "Heaven, Imperial" }, O: ["てん"], R: 512, C: ["大"], T: ["N4", "N4-7"] },
    { _: "晴", K: { は_れる: "Sunny", は_らす: "Clear" }, O: ["せい"], R: 1022, C: ["日", "月"], T: ["N4", "N4-7"] },
    { _: "雪", K: { ゆき: "Snow" }, O: ["せつ"], R: 1131, C: ["雨", "彐"], T: ["N4", "N4-7"] },
    { _: "風", K: { かぜ: "Wind, Air, Style" }, O: ["ふう"], R: 558, C: ["几", "虫"], T: ["N4", "N4-7"] },
    { _: "強", K: { つよ_い: "Strong", つよ_まる: "Get Stronger", つよ_める: "Make Stronger" }, O: ["きょう", "ごう"], R: 112, C: ["弓", "厶", "虫"], T: ["N4", "N4-7"] },
    { _: "弱", K: { よわ_い: "Weak, Frail", よわ_まる: "Get Weaker", よわ_める: "Make Weaker" }, O: ["じゃく"], R: 958, C: ["弓", "冫"], T: ["N4", "N4-7"] },
    { _: "暑", K: { あつ_い: "Hot" }, O: ["しょ"], R: 1442, C: ["日", "者"], T: ["N4", "N4-7"] },
    { _: "寒", K: { さむ_い: "Cold" }, O: ["かん"], R: 1456, C: ["冫"], T: ["N4", "N4-7"] },
    
    { _: "旅", K: { たび: "Journey, Travel" }, O: ["りょ"], R: 783, C: ["方"], T: ["N4", "N4-7"] },
    { _: "持", K: { も_つ: "Hold, Have" }, O: ["じ"], R: 119, C: ["手", "寺"], T: ["N4", "N4-7"] },
    { _: "世", K: { よ: "World, Society, Generation" }, O: ["せい", "せ"], R: 135, T: ["N4", "N4-7"] },
    { _: "界", K: { _: "World, Boundary" }, O: ["かい"], R: 158, C: ["田"], T: ["N4", "N4-7"] },
    { _: "写", K: { うつ_す: "Copy", うつ_る: "Photograph" }, O: ["しゃ"], R: 453, T: ["N4", "N4-7"] },
    { _: "真", K: { ま: "True", まこと: "" }, O: ["しん"], R: 279, C: ["目"], T: ["N4", "N4-7"] },
    { _: "船", K: { ふね: "Boat (Large)" }, O: ["せん"], R: 713, C: ["舟", "八", "口"], T: ["N4", "N4-7"] },
    // #endregion

    // #region Kanji N4-8
    { _: "勉", K: { つと_める: "Strive for" }, O: ["べん"], R: 1066, C: ["免", "力"], T: ["N4", "N4-8"] },
    { _: "漢", K: { _: "Chinese Origin" }, O: ["かん"], R: 1487, C: ["氵", "艹"], T: ["N4", "N4-8"] },
    { _: "宿", K: { やど: "Lodging" }, O: ["しゅく"], R: 701, C: ["宀", "人", "百"], T: ["N4", "N4-8", "Places"] },
    { _: "題", K: { _: "Topic, Subject" }, O: ["だい"], R: 96, C: ["日", "疋", "頁"], T: ["N4", "N4-8", "Academic"] },
    { _: "質", K: { _: "Substance, Quality" }, O: ["しつ"], R: 389, C: ["斤", "貝"], T: ["N4", "N4-8"] },
    { _: "問", K: { と_う: "Ask", と_い: "Query" }, O: ["もん"], R: 64, C: ["門", "口"], T: ["N4", "N4-8", "Academic"] },
    { _: "教", K: { おし_える: "Teach", おそ_わる: "Be Taught" }, O: ["きょう"], R: 166, C: ["耂", "子", "攵"], T: ["N4", "N4-8", "Academic"] },
    { _: "室", K: { _: "Room" }, O: ["しつ"], R: 550, C: ["宀", "至"], T: ["N4", "N4-8", "Places"] },
    
    { _: "試", K: { こころ_みる: "Try (Attempt)", ため_す: "Try (Test)" }, O: ["し"], R: 392, C: ["言", "弋", "工"], T: ["N4", "N4-8", "Academic"] },
    { _: "験", K: { _: "Verification, Effect" }, O: ["けん"], R: 410, C: ["馬"], T: ["N4", "N4-8", "Academic"] },
    { _: "答", K: { こた_える: "Answer" }, O: ["とう"], R: 486, C: ["竹", "合"], T: ["N4", "N4-8", "Academic"] },
    { _: "考", K: { かんが_える: "Think" }, O: ["こう"], R: 196, C: ["耂", "丂"], T: ["N4", "N4-8", "Academic"] },
    { _: "正", K: { ただ_しい: "Correct", ただ_す: "" }, O: ["せい", "しょう"], R: 143, C: ["止"], T: ["N4", "N4-8", "Academic"] },
    { _: "丸", K: { まる: "Circle", まる_い: "Round", まる_める: "Rounding" }, O: ["がん"], R: 542, C: ["九"], T: ["N4", "N4-8"] },
    { _: "不", K: { _: "Negative" }, O: ["ふ"], R: 101, T: ["N4", "N4-8"] },
    { _: "同", K: { おな_じ: "Same" }, O: ["どう"], R: 15, C: ["冂", "口"], T: ["N4", "N4-8"] },
    
    { _: "貸", K: { か_す: "Lend" }, O: ["たい"], R: 995, C: ["代", "貝"], T: ["N4", "N4-8"] },
    { _: "借", K: { か_りる: "Borrow" }, O: ["しゃく"], R: 932, C: ["人", "昔"], T: ["N4", "N4-8"] },
    { _: "返", K: { かえ_る: "Return (Come Back)", かえ_す: "Return (Give Back)" }, O: ["へん"], R: 685, C: ["⻌", "又"], T: ["N4", "N4-8"] },
    { _: "冊", K: { _: "Tome, Volume" }, O: ["さつ", "さく"], R: 1313, T: ["N4", "N4-8"] },
    { _: "歴", K: { _: "Cirriculum, Continuation" }, O: ["れき"], R: 632, C: ["木", "止"], T: ["N4", "N4-8"] },
    { _: "史", K: { _: "History, Chronicle" }, O: ["し"], R: 511, T: ["N4", "N4-8"] },
    { _: "図", K: { _: "Map, Figure" }, O: ["ず", "と"], R: 539, T: ["N4", "N4-8"] },
    // #endregion

    // #region Kanji N4-9
    { _: "運", K: { _: "Luck, Progress", はこ_ぶ: "Carry" }, O: ["うん"], R: 255, C: ["⻌", "車"], T: ["N4", "N4-9"] },
    { _: "動", K: { うご_く: "Move (じ)", うご_かす: "Move (た)" }, O: ["どう"], R: 73, C: ["重", "力"], T: ["N4", "N4-9", "M-0"] },
    { _: "練", K: { _: "Practice, Refine", ね_る: "Work Over, Polish Up, Kneed" }, O: ["れん"], R: 788, C: ["糸", "東"], T: ["N4", "N4-9", "M-0"] },
    { _: "習", K: { なら_う: "To Learn", なら_い: "Habits" }, O: ["しゅう"], R: 706, C: ["羽", "白"], T: ["N4", "N4-9", "M-0"] },
    { _: "走", K: { はし_る: "Run" }, O: ["そう"], R: 626, T: ["N4", "N4-9"] },
    { _: "歩", K: { ある_く: "Walk", あゆ_む: "Walk (Figurative)" }, O: ["ほ"], R: 554, C: ["止", "少"], T: ["N4", "N4-9"] },
    { _: "泳", K: { およ_ぐ: "Swim" }, O: ["えい"], R: 1223, C: ["氵", "永"], T: ["N4", "N4-9"] },
    { _: "才", K: { _: "Genius, Years Old" }, O: ["さい"], R: 1497, T: ["N4", "N4-9"] },
    
    { _: "自", K: { みずか_ら: "Oneself", おの_ずから: "Naturally", おの_ずと: "" }, O: ["じ", "し"], R: 19, T: ["N4", "N4-9"] },
    { _: "然", K: { _: "Resemble", しか_し: "However" }, O: ["ぜん", "ねん"], R: 401, C: ["犬", "火"], T: ["N4", "N4-9"] },
    { _: "草", K: { くさ: "Grass" }, O: ["そう"], R: 967, C: ["艹", "早"], T: ["N4", "N4-9"] },
    { _: "原", K: { _: "Original", はら: "Meadow" }, O: ["げん"], R: 172, C: ["白", "小"], T: ["N4", "N4-9"] },
    { _: "湖", K: { みずうみ: "Lake" }, O: ["こ"], R: 1344, C: ["氵", "胡"], T: ["N4", "N4-9"] },
    { _: "谷", K: { たに: "Valley" }, O: ["こく"], R: 508, C: ["口"], T: ["N4", "N4-9"] },
    { _: "海", K: { うみ: "Sea" }, O: ["かい"], R: 200, C: ["氵", "毎"], T: ["N4", "N4-9"] },
    { _: "辺", K: { あた_り: "Vicinity", べ: "Side, Edge" }, O: ["へん"], R: 428, C: ["⻌", "刀"], T: ["N4", "N4-9"] },
    
    { _: "里", K: { さと: "Village, Hometown" }, O: ["り"], R: 1096, C: ["田", "土"], T: ["N4", "N4-9", "Places"] },
    { _: "野", K: { の: "Plains, Field, Rustic" }, O: ["や", "しょ"], R: 120, C: ["里", "予"], T: ["N4", "N4-9", "Places"] },
    { _: "緑", K: { みどり: "Green" }, O: ["りょく", "ろく"], R: 1180, C: ["糸", "彐", "水"], T: ["N4", "N4-9"] },
    { _: "池", K: { いけ: "Pond, Reservoir" }, O: ["ち"], R: 827, C: ["氵", "也"], T: ["N4", "N4-9", "Places"] },
    { _: "鳥", K: { とり: "Bird" }, O: ["ちょう"], R: 1043, C: ["白", "丂", "火"], T: ["N4", "N4-9", "Animals"] },
    { _: "羽", K: { はね: "Feather, Wing", は: "" }, O: ["う"], R: 748, C: ["冫"], T: ["N4", "N4-9"] },
    { _: "馬", K: { うま: "Horse" }, O: ["ば"], R: 639, C: ["火"], T: ["N4", "N4-9", "Animals"] },
    { _: "鳴", K: { な_く: "Chirp, Cry", な_る: "Ring", な_らす: "" }, O: ["めい"], R: 1279, C: ["口", "鳥"], T: ["N4", "N4-9"] },
    // #endregion

    // #region Unlearned Kanji (N4)
    { _: "者", K: { もの: "Someone, Person" }, O: ["しゃ"], R: 38, C: ["耂", "日"], T: ["N4", "People"] },
    { _: "別", K: { _: "Another", わか_れる: "Break Up", わ_ける: "Separate" }, O: ["べつ"], R: 214, C: ["刀"], T: ["N4"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N4"] },
    // #endregion

    // #region Kanji N3-1
    { _: "起", K: { お_きる: "Wake Up", お_こる: "To Happen", お_こす: "To Cause" }, O: ["き"], R: 374, C: ["走", "已"], T: ["N3", "N3-1"] },
    { _: "寝", K: { ね_る: "To Sleep", ね_かす: "To Put To Sleep" }, O: ["しん"], R: 1034, C: ["宀", "彐", "又"], T: ["N3", "N3-1"] },
    { _: "浴", K: { あ_びる: "Take a Bath", あ_びせる: "" }, O: ["よく"], R: 1136, C: [], T: ["N3", "N3-1"] },
    { _: "湯", K: { ゆ: "Hot Water" }, O: ["とう"], R: 1356, C: ["氵", "昜"], T: ["N3", "N3-1"] },
    
    { _: "洗", K: { あら_う: "Wash" }, O: ["せん"], R: 1168, C: [], T: ["N3", "N3-1"] },
    { _: "濯", K: { _: "Laundry" }, O: ["たく"], R: 1698, C: [], T: ["N3", "N3-1"] },
    { _: "干", K: { ほ_す: "To Dry, To Interfere" }, O: ["かん"], R: 1349, C: [], T: ["N3", "N3-1"] },
    { _: "活", K: { _: "Lively, Active" }, O: ["かつ"], R: 171, C: [], T: ["N3", "N3-1"] },
    
    { _: "拾", K: { ひろ_う: "Pick Up" }, O: ["しゅう", "じゅう"], R: 1479, C: ["手"], T: ["N3", "N3-1"] },
    { _: "捨", K: { す_てる: "Dispose of" }, O: ["しゃ"], R: 1266, C: ["手", "人", "土", "口"], T: ["N3-1"] },
    { _: "燃", K: { も_える: "Be Burned", も_やす: "Burn (Something)", も_す: "" }, O: ["ねん"], R: 948, C: ["火", "然"], T: ["N3", "N3-1"] },
    { _: "袋", K: { ふくろ: "Bag" }, O: ["たい"], R: 1125, C: [], T: ["N3", "N3-1"] },
    
    { _: "曜", K: { _: "Weekday" }, O: ["よう"], R: 940, C: ["日", "彐", "隹"], T: ["N3", "N3-1"] },
    { _: "末", K: { すえ: "End, Tip" }, O: ["まつ", "ばつ"], R: 456, T: ["N3", "N3-1"] },
    { _: "昨", K: { _: "Yesterday, Previous" }, O: ["さく"], R: 226, C: [], T: ["N3", "N3-1"] },
    { _: "翌", K: { _: "The Following, Next" }, O: ["よく"], R: 1070, C: [], T: ["N3", "N3-1"] },
    
    { _: "予", K: { _: "Beforehand, Previous" }, O: ["よ"], R: 180, T: ["N3", "N3-1"] },
    { _: "定", K: { さだ_める: "Stipulate", さだ_まる: "Determined", さだ_か: "Certain" }, O: ["てい", "じょう"], R: 48, C: ["疋"], T: ["N3", "N3-1"] },
    { _: "用", K: { もち_いる: "Utilize" }, O: ["よう"], R: 107, T: ["N3", "N3-1"] },
    { _: "事", K: { _: "Thing, Matter", こと: "Case" }, O: ["じ"], R: 18, T: ["N3", "N3-1"] },
    // #endregion

    // #region Kanji N3-2
    { _: "熱", K: { あつ_い: "Hot, Fever" }, O: ["ねつ"], R: 700, C: [], T: ["N3", "N3-2"] },
    { _: "冷", K: { つめ_たい: "Cold, Cool" }, O: ["れい"], R: 667, C: ["冫"], T: ["N3", "N3-2"] },
    { _: "温", K: { あたた_まる: "Get Warm", あたた_める: "Make Warm", あたた_かい: "Warm" }, O: ["おん"], R: 838, C: [], T: ["N3", "N3-2"] },
    { _: "度", K: { たび: "Degrees, Occurence" }, O: ["ど", "と", "たく"], R: 110, C: ["广", "又"], T: ["N3", "N3-2"] },

    { _: "材", K: { _: "Material" }, O: ["ざい"], R: 565, C: [], T: ["N3", "N3-2"] },
    { _: "型", K: { かた: "Type, Model" }, O: ["けい"], R: 482, C: ["刀", "土"], T: ["N3", "N3-2"] },
    { _: "焼", K: { や_く: "Bake", や_き: "Grilled", や_ける: "Burn" }, O: ["しょう"], R: 982, C: ["火"], T: ["N3", "N3-2"] },
    { _: "器", K: { うつわ: "Vessel" }, O: ["き"], R: 525, C: ["口", "大"], T: ["N3", "N3-2"] },

    { _: "卵", K: { たまご: "Egg" }, O: ["らん"], R: 1342, T: ["N3", "N3-2"] },
    { _: "乳", K: { ちち: "Milk, Breasts" }, O: ["にゅう"], R: 1289, C: ["⺤", "子"], T: ["N3", "N3-2"] },
    { _: "粉", K: { こな: "Powder" }, O: ["ふん"], R: 1484, C: ["米", "分"], T: ["N3", "N3-2"] },
    { _: "塩", K: { しお: "Salt" }, O: ["えん"], R: 1148, C: ["土", "口", "皿"], T: ["N3", "N3-2"] },

    { _: "菜", K: { な: "Vegetable" }, O: ["さい"], R: 1327, C: ["艹", "⺤", "木"], T: ["N3", "N3-2"] },
    { _: "果", K: { は_たす: "To Fulfill", は_てる: "To End" }, O: ["か"], R: 258, C: [], T: ["N3", "N3-2"] },
    { _: "豆", K: { まめ: "Beans, Midget" }, O: ["とう", "ず"], R: 1422, C: ["口", "艹"], T: ["N3", "N3-2"] },
    { _: "缶", K: { _: "Tin Can" }, O: ["かん"], R: 1543, T: ["N3-2"] },
    
    { _: "杯", K: { さかずき: "Counter (Cups)" }, O: ["はい"], R: 1235, C: [], T: ["N3", "N3-2"] },
    { _: "枚", K: { _: "Counter (Sheets)" }, O: ["まい"], R: 911, C: [], T: ["N3", "N3-2"] },
    { _: "匹", K: { _: "Counter (Animals)" }, O: ["ひき"], R: 1384, C: [], T: ["N3", "N3-2"] },
    { _: "量", K: { _: "Amount", はか_る: "Measure" }, O: ["りょう"], R: 469, C: ["日", "里"], T: ["N3", "N3-2"] },
    // #endregion

    // #region Kanji N3-3
    { _: "頭", K: { あたま: "Head" }, O: ["とう", "と", "ず"], R: 433, C: ["豆", "頁"], T: ["N3", "N3-3", "Body"] },
    { _: "顔", K: { かお: "Face" }, O: ["がん"], R: 676, C: [], T: ["N3", "N3-3", "Body"] },
    { _: "首", K: { くび: "Neck" }, O: ["しゅ"], R: 98, C: [], T: ["N3", "N3-3", "Body"] },
    { _: "鼻", K: { はな: "Nose" }, O: ["び"], R: 1632, C: ["自"], T: ["N3", "N3-3", "Body"] },
    
    { _: "呼", K: { よ_ぶ: "Call, Invite" }, O: ["こ"], R: 498, C: ["口"], T: ["N3", "N3-3"] },
    { _: "吸", K: { す_う: "Inhale, Suck" }, O: ["きゅう"], R: 1054, C: [], T: ["N3", "N3-3"] },
    { _: "息", K: { いき: "Breath" }, O: ["そく"], R: 882, C: [], T: ["N3", "N3-3"] },
    { _: "汗", K: { あせ: "Sweat" }, O: ["かん"], R: 1502, C: [], T: ["N3", "N3-3"] },
    
    { _: "検", K: { _: "Examine, Inspect" }, O: ["けん"], R: 290, C: [], T: ["N3", "N3-3"] },
    { _: "査", K: { _: "Investigate" }, O: ["さ"], R: 184, C: [], T: ["N3", "N3-3"] },
    { _: "歯", K: { は: "Tooth" }, O: ["し"], R: 9999, C: [], T: ["N3", "N3-3"] },
    { _: "痛", K: { いた_い: "Painful", いた_む: "To Feel Pain" }, O: ["つう"], R: 903, C: ["疒", "用"], T: ["N3", "N3-3"] },
    
    { _: "血", K: { ち: "Blood" }, O: ["けつ"], R: 832, C: [], T: ["N3", "N3-3"] },
    { _: "液", K: { _: "Fluid, Liquid" }, O: ["えき"], R: 1210, C: [], T: ["N3", "N3-3"] },
    { _: "包", K: { つつ_む: "Wrap" }, O: ["ほう"], R: 954, C: [], T: ["N3", "N3-3"] },
    { _: "帯", K: { おび: "Belt", お_びる: "Take On" }, O: ["たい"], R: 746, C: ["巾"], T: ["N3", "N3-3"] },
    
    { _: "救", K: { すく_う: "Save, Rescue" }, O: ["きゅう"], R: 799, C: ["攵"], T: ["N3", "N3-3"] },
    { _: "助", K: { たす_ける: "To Save", たす_かる: "To Be Saved" }, O: ["じょ"], R: 397, C: [], T: ["N3", "N3-3"] },
    { _: "死", K: { し_ぬ: "Die" }, O: ["し"], R: 229, C: [], T: ["N3", "N3-3"] },
    { _: "亡", K: { な_い: "Deceased" }, O: ["ぼう", "もう"], R: 661, C: [], T: ["N3", "N3-3"] },
    // #endregion

    // #region Kanji N3-4
    { _: "角", K: { かど: "Corner, Angle", つの: "Horn, Antlers" }, O: ["かく"], R: 805, T: ["N3", "N3-4"] },
    { _: "曲", K: { ま_がる: "Bend", ま_げる: "Bend (Something)" }, O: ["きょく"], R: 810, C: [], T: ["N3", "N3-4"] },
    { _: "折", K: { おり: "Fold", お_る: "", お_れる: "Break" }, O: ["せつ"], R: 962, C: ["手", "斤"], T: ["N3", "N3-4"] },
    { _: "路", K: { じ: "Road" }, O: ["ろ"], R: 529, C: [], T: ["N3", "N3-4"] },

    { _: "追", K: { お_う: "Chase, Follow Up" }, O: ["つい"], R: 411, C: [], T: ["N3", "N3-4"] },
    { _: "突", K: { つ_く: "Poke, Thrust" }, O: ["とつ"], R: 521, C: [], T: ["N3", "N3-4"] },
    { _: "転", K: { ころ_がる: "Roll (じ)", ころ_げる: "Roll (た)" }, O: ["てん"], R: 327, C: ["車", "云"], T: ["N3", "N3-4"] },
    { _: "倒", K: { たお_れる: "Fall Down", たお_す: "Knock Down" }, O: ["とう"], R: 791, C: [], T: ["N3", "N3-4"] },
    
    { _: "位", K: { くらい: "Rank" }, O: ["い"], R: 276, C: [], T: ["N3", "N3-4"] },
    { _: "置", K: { お_く: "Placement" }, O: ["ち"], R: 277, C: [], T: ["N3", "N3-4"] },
    { _: "横", K: { よこ: "Beside" }, O: ["おう"], R: 480, C: ["木", "黄"], T: ["N3", "N3-4"] },
    { _: "央", K: { _: "Center, Middle" }, O: ["おう"], R: 582, T: ["N3", "N3-4"] },
    
    { _: "直", K: { ただ_ちに: "Immediately", なお_す: "Fix", なお_る: "" }, O: ["ちょく", "じき"], R: 246, C: ["十", "目"], T: ["N3", "N3-4"] },
    { _: "線", K: { _: "Line, Track" }, O: ["せん"], R: 382, C: ["糸", "白", "水"], T: ["N3", "N3-4"] },
    { _: "逆", K: { _: "Reverse, Opposite", さか_らう: "Go Against" }, O: ["ぎゃく"], R: 683, C: [], T: ["N3", "N3-4"] },
    { _: "側", K: { がわ: "Side" }, O: ["そく"], R: 216, C: ["人", "貝", "刀"], T: ["N3", "N3-4"] },
    
    { _: "注", K: { _: "Note", そそ_ぐ: "Pour", さ_す: "Attention" }, O: ["ちゅう"], R: 497, C: ["氵", "主"], T: ["N3", "N3-4"] },
    { _: "意", K: { _: "Idea, Intention" }, O: ["い"], R: 99, C: ["音", "心"], T: ["N3", "N3-4"] },
    { _: "橋", K: { はし: "Bridge" }, O: ["きょう"], R: 553, C: [], T: ["N3", "N3-4"] },
    { _: "進", K: { すす_む: "Continue", すす_める: "" }, O: ["しん"], R: 142, C: [], T: ["N3", "N3-4"] },
    // #endregion

    // #region Kanji N3-5
    { _: "戦", K: { たたか_う: "Fight, Struggle", いくさ: "War, Battle" }, O: ["せん"], R: 78, C: ["単"], T: ["N3", "N3-5"] },
    { _: "決", K: { き_める: "Decide", き_まる: "" }, O: ["けつ"], R: 71, C: [], T: ["N3", "N3-5"] },
    { _: "勝", K: { か_つ: "Win", まさ_る: "To Excel, Be Superior To" }, O: ["しょう"], R: 185, C: ["月", "力"], T: ["N3", "N3-5"] },
    { _: "負", K: { ま_ける: "Lose", ま_かす: "" }, O: ["ふ"], R: 443, C: ["貝"], T: ["N3", "N3-5"] },

    { _: "代", K: { か_わる: "Be Replaced (じ)", か_える: "Replace (た)", よ: "" }, O: ["だい", "たい"], R: 66, C: ["人", "弋"], T: ["N3", "N3-5"] },
    { _: "表", K: { あらわ_れる: "To Surface", あら_わす: "", おもて: "Front" }, O: ["ひょう"], R: 77, C: [], T: ["N3", "N3-5"] },
    { _: "第", K: { _: "Number (Position)" }, O: ["だい"], R: 160, C: [], T: ["N3", "N3-5"] },
    { _: "回", K: { _: "Times (Number of)", まわ_る: "Rotate", まわ_す: "Turn" }, O: ["かい", "え"], R: 50, C: ["口"], T: ["N3", "N3-5"] },
    
    { _: "記", K: { しる_す: "Scribe, Write Down" }, O: ["き"], R: 149, C: ["言", "已"], T: ["N3", "N3-5"] },
    { _: "録", K: { _: "Record" }, O: ["ろく"], R: 546, C: [], T: ["N3", "N3-5"] },
    { _: "優", K: { やさ_しい: "Kind", すぐ_れる: "Excel", まさ_る: "Superior" }, O: ["ゆう"], R: 334, C: ["人", "自", "心"], T: ["N3", "N3-5"] },
    { _: "賞", K: { _: "Award" }, O: ["しょう"], R: 426, C: [], T: ["N3", "N3-5"] },
    
    { _: "秒", K: { _: "Seconds" }, O: ["びょう"], R: 1015, C: [], T: ["N3", "N3-5"] },
    { _: "差", K: { _: "Distinction, Difference", さ_す: "Insert" }, O: ["さ"], R: 449, C: ["王", "工"], T: ["N3", "N3-5"] },
    { _: "測", K: { はか_る: "Measure" }, O: ["そく"], R: 761, C: [], T: ["N3", "N3-5"] },
    { _: "順", K: { _: "Order" }, O: ["じゅん"], R: 779, C: [], T: ["N3", "N3-5"] },
    
    { _: "球", K: { たま: "Ball, Sphere" }, O: ["きゅう"], R: 302, C: ["王", "水"], T: ["N3", "N3-5"] },
    { _: "打", K: { う_つ: "Strike, Hit" }, O: ["だ"], R: 239, C: [], T: ["N3", "N3-5"] },
    { _: "投", K: { _: "Launch Into, Invest In", な_げる: "Throw, Cast Away" }, O: ["とう"], R: 236, C: ["手", "几", "又"], T: ["N3", "N3-5"] },
    { _: "点", K: { _: "Point, Mark" }, O: ["てん"], R: 165, C: ["火"], T: ["N3", "N3-5"] },
    // #endregion

    // #region Kanji N3-6
    { _: "感", K: { _: "Emotion, Feeling" }, O: ["かん"], R: 233, C: [], T: ["N3", "N3-6"] },
    { _: "情", K: { なさ_け: "Compassion" }, O: ["じょう", "せい"], R: 235, C: [], T: ["N3", "N3-6"] },
    { _: "恋", K: { こ_う: "To Love", こい: "Love", こい_しい: "Lovely" }, O: ["れん"], R: 1296, C: [], T: ["N3", "N3-6"] },
    { _: "愛", K: { _: "Love" }, O: ["あい"], R: 640, C: ["龸", "心", "夂"], T: ["N3", "N3-6"] },

    { _: "信", K: { _: "Faith, Trust" }, O: ["しん"], R: 208, C: ["人", "言"], T: ["N3", "N3-6"] },
    { _: "想", K: { _: "Idea, Thoughts" }, O: ["そう"], R: 381, C: [], T: ["N3", "N3-6"] },
    { _: "伝", K: { つた_わる: "Communicate", つた_える: "Tell", つた_う: "Convey" }, O: ["でん"], R: 416, C: ["人", "厶"], T: ["N3", "N3-6"] },
    { _: "欲", K: { ほっ_する: "Want", ほ_しい: "" }, O: ["よく"], R: 902, C: [], T: ["N3", "N3-6"] },
    
    { _: "苦", K: { くる_しむ: "Suffering", くる_しめる: "", くる_しい: "", にが_る: "Bitter", にが_い: "" }, O: ["く"], R: 623, C: [], T: ["N3", "N3-6"] },
    { _: "悩", K: { なや_む: "Worry", なや_ます: "" }, O: ["のう"], R: 1084, C: [], T: ["N3", "N3-6"] },
    { _: "困", K: { こま_る: "Trouble, Distress" }, O: ["こん"], R: 843, C: [], T: ["N3", "N3-6"] },
    { _: "難", K: { かた_い: "Hard", むずか_しい: "Difficult" }, O: ["なん"], R: 330, C: ["艹", "隹"], T: ["N3", "N3-6"] },
    
    { _: "怒", K: { おこ_る: "Get Angry", いか_る: "Furious" }, O: ["ど"], R: 1221, C: [], T: ["N3", "N3-6"] },
    { _: "悲", K: { かな_しい: "Sad", かな_しむ: "Grieve" }, O: ["ひ"], R: 1014, C: ["非", "心"], T: ["N3", "N3-6"] },
    { _: "笑", K: { わら_う: "Laugh", え_む: "Smile" }, O: ["しょう"], R: 913, C: [], T: ["N3", "N3-6"] },
    { _: "喜", K: { よろこ_ぶ: "Be Happy" }, O: ["き"], R: 769, C: [], T: ["N3", "N3-6"] },
    
    { _: "残", K: { のこ_る: "Remaining", のこ_す: "Leave (Behind)" }, O: ["ざん"], R: 380, C: ["歹", "戈"], T: ["N3", "N3-6"] },
    { _: "念", K: { _: "Mind, Wish, Desire" }, O: ["ねん"], R: 390, C: ["今", "心"], T: ["N3", "N3-6"] },
    { _: "泣", K: { な_く: "Cry" }, O: ["きゅう"], R: 1380, C: [], T: ["N3", "N3-6"] },
    { _: "涙", K: { なみだ: "Tears" }, O: ["るい"], R: 1381, C: [], T: ["N3", "N3-6"] },
    // #endregion

    // #region Kanji N3-7
    { _: "結", K: { むす_ぶ: "Tie, Bind", ゆ_う: "", ゆ_わえる: "" }, O: ["けつ"], R: 162, C: [], T: ["N3", "N3-7"] },
    { _: "婚", K: { _: "Marriage" }, O: ["こん"], R: 767, C: ["女", "氏", "日"], T: ["N3", "N3-7"] },
    { _: "紹", K: { _: "Introduce, Inherit" }, O: ["しょう"], R: 963, C: ["糸", "刀", "口"], T: ["N3", "N3-7"] },
    { _: "介", K: { _: "Mediate, Concern Oneself with" }, O: ["かい"], R: 617, C: ["人", "八"], T: ["N3", "N3-7"] },
    
    { _: "独", K: { ひと_り: "Single, Alone" }, O: ["どく"], R: 365, C: ["犬", "虫"], T: ["N3", "N3-7"] },
    { _: "身", K: { み: "Somebody" }, O: ["しん"], R: 320, C: [], T: ["N3", "N3-7"] },
    { _: "貯", K: { _: "Savings" }, O: ["ちょ"], R: 1100, C: ["貝"], T: ["N3", "N3-7"] },
    { _: "期", K: { _: "Period" }, O: ["き", "ご"], R: 117, C: ["月"], T: ["N3", "N3-7"] },
    
    { _: "約", K: { つづ_める: "Make a Contract", つづ_まる: "Engaged" }, O: ["やく"], R: 94, C: ["糸"], T: ["N3", "N3-7"] },
    { _: "束", K: { たば: "Bundle", たば_ねる: "Make Bundle" }, O: ["そく"], R: 918, C: ["口", "木"], T: ["N3", "N3-7"] },
    { _: "必", K: { かなら_ず: "Certain" }, O: ["ひつ"], R: 265, C: ["心"], T: ["N3", "N3-7"] },
    { _: "守", K: { まも_る: "Protect" }, O: ["しゅ", "す"], R: 457, C: ["宀", "寸"], T: ["N3", "N3-7"] },
    
    { _: "式", K: { _: "Style, Ceremony" }, O: ["しき"], R: 251, C: ["工", "弋"], T: ["N3", "N3-7"] },
    { _: "列", K: { _: "Row, Column" }, O: ["れつ"], R: 927, C: ["歹"], T: ["N3", "N3-7"] },
    { _: "祝", K: { いわ_う: "Celebrate, Congratulate" }, O: ["しゅく", "しゅう"], R: 1184, C: [], T: ["N3", "N3-7"] },
    { _: "酔", K: { よ_う: "Drunk" }, O: ["すい"], R: 1640, C: ["酉", "九", "十"], T: ["N3", "N3-7"] },
    
    { _: "永", K: { なが_い: "Eternity, Long Time" }, O: ["えい"], R: 846, C: ["水"], T: ["N3", "N3-7", "Time"] },
    { _: "願", K: { ねが_う: "Petition, Request, Hope" }, O: ["がん"], R: 894, C: ["頁"], T: ["N3", "N3-7"] },
    { _: "幸", K: { さいわ_い: "Blessing, Fortune", さち: "", しあわ_せ: "Happiness" }, O: ["こう"], R: 786, C: [], T: ["N3", "N3-7"] },
    { _: "福", K: { _: "Blessing, Fortune" }, O: ["ふく"], R: 467, C: [], T: ["N3", "N3-7"] },
    // #endregion

    // #region Kanji N3-8
    { _: "関", K: { かか_わる: "Involved", せき: "Connection, Barrier, Gateway" }, O: ["かん"], R: 70, C: ["門"], T: ["N3", "N3-8"] },
    { _: "係", K: { かか_る: "Related", かかり: "" }, O: ["けい"], R: 232, C: [], T: ["N3", "N3-8"] },
    { _: "和", K: { _: "Harmony, Japanese Style", やわ_らぐ: "Calm Down", やわ_らげる: "Relieve, Soothe", なご_やか: "Peaceful" }, O: ["わ", "お"], R: 124, C: ["禾", "口"], T: ["N3", "N3-8"] },
    { _: "付", K: { つ_く: "Attach", つ_ける: "Wear" }, O: ["ふ"], R: 322, C: ["人", "寸"], T: ["N3", "N3-8"] },

    { _: "娘", K: { むすめ: "Daughter, Girl" }, O: ["じょう"], R: 1145, C: ["女"], T: ["N3", "N3-8"] },
    { _: "老", K: { お_いる: "Grow Old", ふ_ける: "Age" }, O: ["ろう"], R: 803, C: [], T: ["N3", "N3-8"] },
    { _: "婦", K: { _: "Lady, Woman" }, O: ["ふ"], R: 671, C: ["女"], T: ["N3", "N3-8"] },
    { _: "姓", K: { _: "Surname" }, O: ["せい"], R: 1628, C: ["女", "生"], T: ["N3", "N3-8"] },
    
    { _: "仲", K: { なか: "Relationship" }, O: ["ちゅう"], R: 919, C: ["人", "中"], T: ["N3", "N3-8"] },
    { _: "君", K: { きみ: "You" }, O: ["くん"], R: 947, C: ["口"], T: ["N3", "N3-8"] },
    { _: "彼", K: { かれ: "He", かの: "She" }, O: ["ひ"], R: 648, C: ["彳"], T: ["N3", "N3-8"] },
    { _: "他", K: { ほか: "Other" }, O: ["た"], R: 543, C: ["人"], T: ["N3", "N3-8"] },
    
    { _: "初", K: { そ_める: "Start", はじ_め: "Beginning", はじ_めて: "For the first time", はつ: "First Time", うい: "" }, O: ["しょ"], R: 152, C: ["衤", "刀"], T: ["N3", "N3-8"] },
    { _: "再", K: { ふたた_び: "Again, Second Time" }, O: ["さい", "さ"], R: 275, C: [], T: ["N3", "N3-8"] },
    { _: "久", K: { ひさ_しい: "Long (time)" }, O: ["きゅう", "く"], R: 688, C: [], T: ["N3", "N3-8"] },
    { _: "達", K: { _: "Accomplished" }, O: ["たつ"], R: 500, C: ["⻌"], T: ["N3", "N3-8"] },
    
    { _: "個", K: { _: "Private" }, O: ["こ"], R: 451, C: [], T: ["N3", "N3-8"] },
    { _: "性", K: { _: "Gender, Nature" }, O: ["せい", "しょう"], R: 104, C: ["心", "生"], T: ["N3", "N3-8"] },
    { _: "各", K: { おのおの: "Each" }, O: ["かく"], R: 243, C: [], T: ["N3", "N3-8"] },
    { _: "格", K: { _: "Rank, Status" }, O: ["かく", "こう"], R: 281, C: ["木", "各"], T: ["N3", "N3-8"] },
    // #endregion

    // #region Kanji N3-9
    { _: "幼", K: { _: "Infancy", おさな_い: "Very Young" }, O: ["よう"], R: 1227, C: ["幺", "力"], T: ["N3", "N3-9"] },
    { _: "児", K: { こ: "Newborn, Child" }, O: ["じ"], R: 679, C: [], T: ["N3", "N3-9"] },
    { _: "童", K: { わらべ: "Juvenile, Child" }, O: ["どう"], R: 1138, C: [], T: ["N3", "N3-9"] },
    { _: "徒", K: { と: "Junior" }, O: ["と"], R: 817, C: [], T: ["N3", "N3-9"] },
    
    { _: "担", K: { かつ_ぐ: "Carry", にな_う: "Shoulder, Bear" }, O: ["たん"], R: 422, C: [], T: ["N3", "N3-9"] },
    { _: "任", K: { まか_せる: "Leave to me", まか_す: "Entrust" }, O: ["にん"], R: 217, C: [], T: ["N3", "N3-9"] },
    { _: "師", K: { _: "Teacher" }, O: ["し"], R: 563, C: [], T: ["N3", "N3-9"] },
    { _: "組", K: { く_む: "Assemble", くみ: "Set (N)", ぐみ: "" }, O: ["そ"], R: 204, C: ["糸", "目"], T: ["N3", "N3-9"] },
    
    { _: "机", K: { つくえ: "Desk, Table" }, O: ["き"], R: 1671, C: [], T: ["N3", "N3-9"] },
    { _: "座", K: { すわ_る: "Sit" }, O: ["ざ"], R: 588, C: [], T: ["N3", "N3-9"] },
    { _: "板", K: { いた: "Plank, Board" }, O: ["はん", "ばん"], R: 926, C: ["木", "厂", "又"], T: ["N3", "N3-9"] },
    { _: "筆", K: { ふで: "Writing Brush" }, O: ["ひつ"], R: 1132, C: [], T: ["N3", "N3-9"] },
    
    { _: "政", K: { まつりごと: "Politics, Government" }, O: ["せい", "しょう"], R: 17, C: [], T: ["N3", "N3-9"] },
    { _: "治", K: { おさ_まる: "Govern", おさ_める: "Rule", なお_る: "Heal", なお_す: "Cure" }, O: ["じ", "ち"], R: 109, C: [], T: ["N3", "N3-9"] },
    { _: "経", K: { へ_る: "Go Through" }, O: ["けい", "きょう"], R: 79, C: ["糸", "又", "土"], T: ["N3", "N3-9"] },
    { _: "済", K: { す_む: "Done", す_ます: "Completed"  }, O: ["さい"], R: 168, C: ["氵", "斉"], T: ["N3", "N3-9"] },
    
    { _: "具", K: { _: "Tool, Ingredient" }, O: ["ぐ"], R: 629, C: [], T: ["N3", "N3-9"] },
    { _: "箱", K: { はこ: "Box" }, O: ["そう"], R: 1357, C: [], T: ["N3", "N3-9"] },
    { _: "棒", K: { _: "Rod, Stick" }, O: ["ぼう"], R: 1455, C: [], T: ["N3", "N3-9"] },
    { _: "伸", K: { の_びる: "Stretch (self)", の_ばす: "Stretch (something)", の_べる: "Extend (abstract)" }, O: ["しん"], R: 730, C: [], T: ["N3", "N3-9"] },
    // #endregion

    // #region Kanji N3-10
    { _: "希", K: { _: "Hope, Beseech" }, O: ["き"], R: 896, C: [], T: ["N3", "N3-10"] },
    { _: "望", K: { のぞ_む: "Wish" }, O: ["ぼう", "もう"], R: 470, C: ["月", "王"], T: ["N3", "N3-10"] },
    { _: "夢", K: { ゆめ: "Dream" }, O: ["む"], R: 943, C: [], T: ["N3", "N3-10"] },
    { _: "的", K: { まと: "Target" }, O: ["てき"], R: 105, C: ["白"], T: ["N3", "N3-10"] },


    { _: "可", K: { べ_き: "Can, Approval", べ_し: "" }, O: ["か"], R: 314, C: ["口"], T: ["N3", "N3-10"] },
    { _: "能", K: { _: "Ability, Talent", よ_く: "Well", あた_う: "Can" }, O: ["のう"], R: 273, C: ["厶", "月", "匕"], T: ["N3", "N3-10"] },
    { _: "調", K: { しら_べる: "Investigate", しら_べ: "Research", ととの_う: "Tune", ととの_える: "Adjust" }, O: ["ちょう"], R: 87, C: ["言", "周"], T: ["N3", "N3-10"] },
    { _: "選", K: { えら_ぶ: "Select, Choose" }, O: ["せん"], R: 57, C: [], T: ["N3", "N3-10"] },
    
    { _: "面", K: { おも: "Mask, Surface", おもて: "", つら: "" }, O: ["めん", "べん"], R: 186, T: ["N3", "N3-10"] },
    { _: "接", K: { つ_ぐ: "Connect" }, O: ["せつ"], R: 523, C: ["手", "立", "女"], T: ["N3", "N3-10"] },
    { _: "受", K: { う_かる: "Accept", う_ける: "" }, O: ["じゅ"], R: 136, C: [], T: ["N3", "N3-10"] },
    { _: "落", K: { お_ちる: "Fall", お_とす: "Drop" }, O: ["らく"], R: 420, C: [], T: ["N3", "N3-10"] },
    
    { _: "倍", K: { _: "Double" }, O: ["ばい"], R: 714, C: [], T: ["N3", "N3-10"] },
    { _: "率", K: { ひき_いる: "Lead, Ratio" }, O: ["そつ", "りつ"], R: 383, C: [], T: ["N3", "N3-10"] },
    { _: "平", K: { たい_ら: "Flat" }, O: ["へい", "びょう"], R: 128, C: ["干"], T: ["N3", "N3-10"] },
    { _: "均", K: { _: "Average" }, O: ["きん"], R: 715, C: [], T: ["N3", "N3-10"] },
    
    { _: "成", K: { な_る: "Become", な_す: "" }, O: ["せい", "じょう"], R: 116, C: [], T: ["N3", "N3-10"] },
    { _: "績", K: { _: "Achievements" }, O: ["せき"], R: 820, C: [], T: ["N3", "N3-10"] },
    { _: "良", K: { よ_い: "Good" }, O: ["りょう"], R: 501, C: [], T: ["N3", "N3-10"] },
    { _: "悪", K: { わる_い: "Bad" }, O: ["あく", "お"], R: 530, C: ["亜", "心"], T: ["N3", "N3-10"] },
    // #endregion

    // #region Kanji N3-11
    { _: "授", K: { さず_ける: "Bestow, Grant", さず_かる: "Be Given" }, O: ["じゅ"], R: 535, C: ["手", "龸", "又"], T: ["N3", "N3-11"] },
    { _: "業", K: { わざ: "Business" }, O: ["ぎょう", "ごう"], R: 43, T: ["N3", "N3-11"] },
    { _: "級", K: { _: "Class, Grade" }, O: ["きゅう"], R: 785, C: ["糸"], T: ["N3", "N3-11"] },
    { _: "卒", K: { _: "Graduate, Soldier" }, O: ["そつ", "しゅつ"], R: 772, C: ["亠", "人", "十"], T: ["N3", "N3-11"] },
    
    { _: "欠", K: { _: "Yawning", か_ける: "Chipped", か_く: "Lacking" }, O: ["けつ"], R: 860, C: ["人"], T: ["N3", "N3-11"] },
    { _: "席", K: { _: "Seat" }, O: ["せき"], R: 370, C: ["广"], T: ["N3", "N3-11"] },
    { _: "由", K: { よし: "Wherefore, A Reason", よ_る: "By" }, O: ["ゆ", "ゆう", "ゆい"], R: 325, C: ["田"], T: ["N3", "N3-11"] },
    { _: "訳", K: { わけ: "Translate, Circumstance" }, O: ["やく"], R: 1050, C: [], T: ["N3", "N3-11"] },
    
    { _: "例", K: { たと_える: "Example, Custom" }, O: ["れい"], R: 399, C: [], T: ["N3", "N3-11"] },
    { _: "易", K: { やさ_しい: "Easy", やす_い: "" }, O: ["えき", "い"], R: 571, C: [], T: ["N3", "N3-11"] },
    { _: "解", K: { と_ける: "Solvable", と_く: "Solve", と_かす: "" }, O: ["かい", "げ"], R: 176, C: ["角", "刀", "牛"], T: ["N3", "N3-11"] },
    { _: "説", K: { _: "Theory", と_く: "Preach, Advocate" }, O: ["せつ", "ぜい"], R: 326, C: ["言", "口", "儿"], T: ["N3", "N3-11"] },
    
    { _: "覚", K: { おぼ_える: "Remember", さ_ます: "Awaken", さ_める: "" }, O: ["かく"], R: 710, C: ["龸", "見"], T: ["N3", "N3-11"] },
    { _: "忘", K: { わす_れる: "Forget" }, O: ["ぼう"], R: 1129, C: ["亡", "心"], T: ["N3", "N3-11"] },
    { _: "努", K: { つと_める: "Toil, Diligent" }, O: ["ど"], R: 749, C: ["女", "又", "力"], T: ["N3", "N3-11"] },
    { _: "続", K: { つづ_く: "Continue", つづ_ける: "" }, O: ["ぞく"], R: 141, C: [], T: ["N3", "N3-11"] },
    
    { _: "要", K: { い_る: "Need", かなめ: "Essential" }, O: ["よう"], R: 106, C: ["女"], T: ["N3", "N3-11"] },
    { _: "復", K: { _: "Restore, Resume" }, O: ["ふく"], R: 438, C: ["彳", "日", "夂"], T: ["M-0", "N3", "N3-11"] },
    { _: "補", K: { おぎな_う: "Supplement, Compensate" }, O: ["ほ"], R: 332, C: [], T: ["N3", "N3-11"] },
    { _: "効", K: { き_く: "Effective" }, O: ["こう"], R: 538, C: ["父", "力"], T: ["N3", "N3-11"] },
    // #endregion

    // #region Kanji N3-12
    { _: "種", K: { たね: "Species, Kind" }, O: ["しゅ"], R: 461, C: ["重"], T: ["N3", "N3-12"] },
    { _: "類", K: { たぐ_い: "Sort, Kind" }, O: ["るい"], R: 678, C: ["頁"], T: ["N3", "N3-12"] },
    { _: "存", K: { _: "Existence" }, O: ["そん"], R: 577, C: ["子"], T: ["N3", "N3-12"] },
    { _: "在", K: { あ_る: "To Exist" }, O: ["ざい"], R: 211, C: ["土"], T: ["N3", "N3-12"] },
    
    { _: "陽", K: { _: "Positive, Sunshine" }, O: ["よう"], R: 1071, C: ["⻏", "昜"], T: ["N3", "N3-12"] },
    { _: "巨", K: { _: "Gigantic" }, O: ["きょ"], R: 892, C: [], T: ["N3", "N3-12"] },
    { _: "氷", K: { こおり: "Ice", ひ: "" }, O: ["ひょう"], R: 1450, C: [], T: ["N3", "N3-12"] },
    { _: "河", K: { かわ: "River" }, O: ["か"], R: 663, C: ["可"], T: ["N3", "N3-12"] },
    
    { _: "季", K: { _: "Seasons" }, O: ["き"], R: 842, C: [], T: ["N3", "N3-12"] },
    { _: "候", K: { そうろう: "Climate, Weather" }, O: ["こう"], R: 510, C: [], T: ["N3", "N3-12"] },
    { _: "暖", K: { あたた_か: "Warm", あたた_まる: "", あたた_める: "" }, O: ["だん"], R: 1371, C: [], T: ["N3", "N3-12"] },
    { _: "流", K: { なが_れる: "Flowing", なが_す: "Flush" }, O: ["りゅう", "る"], R: 280, C: ["氵", "厶", "川"], T: ["N3", "N3-12"] },
    
    { _: "形", K: { かた: "Shape", かたち: "",  }, O: ["けい", "ぎょう"], R: 418, C: [], T: ["N3", "N3-12"] },
    { _: "底", K: { そこ: "Bottom" }, O: ["てい"], R: 867, C: [], T: ["N3", "N3-12"] },
    { _: "深", K: { ふか_い: "Deep", ふか_まる: "Deepening", ふか_める: "Deepen" }, O: ["しん"], R: 484, C: ["氵", "木"], T: ["N3", "N3-12"] },
    { _: "浅", K: { あさ_い: "Shallow" }, O: ["せん"], R: 1253, C: [], T: ["N3", "N3-12"] },
    
    { _: "島", K: { しま: "Island" }, O: ["とう"], R: 245, C: [], T: ["N3", "N3-12"] },
    { _: "陸", K: { _: "Land" }, O: ["りく"], R: 736, C: [], T: ["N3", "N3-12"] },
    { _: "岸", K: { きし: "Shore, Beach" }, O: ["がん"], R: 556, C: [], T: ["N3", "N3-12"] },
    { _: "坂", K: { さか: "Slope, Hill" }, O: ["はん"], R: 865, C: [], T: ["N3", "N3-12"] },
    // #endregion
    
    // #region Kanji N3-13
    { _: "準", K: { じゅん_じる: "Conform, Imitate" }, O: ["じゅん"], R: 425, C: [], T: ["N3", "N3-13"] },
    { _: "備", K: { そな_える: "To Prepare", そな_わる: "To Be Prepared" }, O: ["び"], R: 356, C: [], T: ["N3", "N3-13"] },
    { _: "迎", K: { むか_える: "Welcome" }, O: ["げい"], R: 625, C: [], T: ["N3", "N3-13"] },
    { _: "変", K: { か_わる: "To Change (Self)", か_える: "To Change (Something)" }, O: ["へん"], R: 238, C: [], T: ["N3", "N3-13"] },
    
    { _: "飛", K: { と_ぶ: "Fly, Jump" }, O: ["ひ"], R: 580, C: [], T: ["N3", "N3-13"] },
    { _: "移", K: { うつ_る: "To Change Location, Spread (Self)", うつ_す: "To Move (Something)" }, O: ["い"], R: 448, C: [], T: ["N3", "N3-13"] },
    { _: "登", K: { のぼ_る: "Ascend" }, O: ["とう", "と"], R: 566, C: [], T: ["N3", "N3-13"] },
    { _: "泊", K: { と_まる: "Stay Overnight", と_める: "Let someone stay" }, O: ["はく"], R: 1233, C: ["氵", "白"], T: ["N3", "N3-13"] },
    
    { _: "団", K: { _: "Group" }, O: ["だん", "とん"], R: 213, C: ["口", "寸"], T: ["N3", "N3-13"] },
    { _: "程", K: { ほど: "Extent, Degree" }, O: ["てい"], R: 514, C: [], T: ["N3", "N3-13"] },
    { _: "欧", K: { _: "Europe" }, O: ["おう"], R: 421, C: [], T: ["N3", "N3-13"] },
    { _: "州", K: { す: "State, Province" }, O: ["しゅう"], R: 386, C: [], T: ["N3", "N3-13"] },
    
    { _: "観", K: { _: "Outlook, View" }, O: ["かん"], R: 476, C: ["隹", "見"], T: ["N3", "N3-13"] },
    { _: "舟", K: { ふね: "Boat (Small)", ふな: "" }, O: ["しゅう"], R: 1786, T: ["N3", "N3-13"] },
    { _: "芸", K: { _: "Technique, Art, Performance" }, O: ["げい"], R: 719, C: ["艹", "厶"], T: ["N3", "N3-13"] },
    { _: "演", K: { _: "Performance, Act" }, O: ["えん"], R: 267, C: [], T: ["N3", "N3-13"] },
    
    { _: "仏", K: { ほとけ: "Buddha" }, O: ["ぶつ"], R: 819, C: ["人", "厶"], T: ["N3", "N3-13"] },
    { _: "神", K: { かみ: "God", かん: "", こう: "" }, O: ["しん", "じん"], R: 347, C: [], T: ["N3", "N3-13"] },
    { _: "祭", K: { まつ_る: "Celebrate", まつ_り: "Festival (Casual)", まつり: "Festival (Formal)" }, O: ["さい"], R: 1124, C: [], T: ["N3", "N3-13"] },
    { _: "絵", K: { _: "Picture, Painting" }, O: ["え", "かい"], R: 895, C: ["糸", "会"], T: ["N3", "N3-13"] },
    // #endregion
    
    // #region Kanji N3-14
    { _: "押", K: { お_す: "Push", お_さえる: "Hold" }, O: ["おう"], R: 789, C: [], T: ["N3", "N3-14"] },
    { _: "引", K: { ひ_く: "Pull", ひ_ける: "Be Pulled" }, O: ["いん"], R: 218, C: ["弓"], T: ["N3", "N3-14"] },
    { _: "取", K: { と_る: "Take" }, O: ["しゅ"], R: 122, C: ["耳", "又"], T: ["N3", "N3-14"] },
    { _: "消", K: { き_える: "Disappear", け_す: "Erase" }, O: ["しょう"], R: 345, C: ["氵", "小", "月"], T: ["N3", "N3-14"] },
    
    { _: "戸", K: { と: "Door, House Counter" }, O: ["こ"], R: 575, C: ["尸"], T: ["N3", "N3-14"] },
    { _: "窓", K: { まど: "Window" }, O: ["そう"], R: 1186, C: [], T: ["N3", "N3-14"] },
    { _: "階", K: { _: "Floor (#)" }, O: ["かい"], R: 513, C: [], T: ["N3", "N3-14"] },
    { _: "段", K: { _: "Grade, Steps" }, O: ["だん"], R: 479, C: [], T: ["N3", "N3-14"] },
    
    { _: "植", K: { う_える: "To Plant", う_わる: "Be Planted" }, O: ["しょく"], R: 699, C: ["木", "十", "目"], T: ["N3", "N3-14"] },
    { _: "葉", K: { は: "Leaf" }, O: ["よう"], R: 414, C: ["艹", "世", "木"], T: ["N3", "N3-14"] },
    { _: "実", K: { _: "Reality", み: "Fruit", みの_る: "Bear Fruit, Ripen" }, O: ["じつ"], R: 68, T: ["N3", "N3-14"] },
    { _: "根", K: { ね: "Root" }, O: ["こん"], R: 620, C: ["木", "艮"], T: ["N3", "N3-14"] },
    
    { _: "建", K: { た_つ: "Build, Erect", た_てる: "Be Built" }, O: ["けん", "こん"], R: 300, C: [], T: ["N3", "N3-14"] },
    { _: "築", K: { きず_く: "Fabricate, Construct" }, O: ["ちく"], R: 821, C: [], T: ["N3", "N3-14"] },
    { _: "構", K: { かま_える: "Get Ready, Set Up", かま_う: "Take Care" }, O: ["こう"], R: 316, C: ["木"], T: ["N3", "N3-14"] },
    { _: "造", K: { つく_る: "Manufacture" }, O: ["ぞう"], R: 429, C: [], T: ["N3", "N3-14"] },
    
    { _: "設", K: { もう_ける: "Establish" }, O: ["せつ"], R: 145, C: [], T: ["N3", "N3-14"] },
    { _: "柱", K: { はしら: "Pillar" }, O: ["ちゅう"], R: 1119, C: [], T: ["N3", "N3-14"] },
    { _: "庫", K: { _: "Warehouse" }, O: ["こ", "く"], R: 852, C: ["广", "車"], T: ["N3", "N3-14"] },
    { _: "向", K: { む_く: "Turn", む_ける: "Point Towards", む_かう: "Heading", む_こう: "Over There" }, O: ["こう"], R: 182, C: [], T: ["N3", "N3-14"] },
    // #endregion
    
    // #region Kanji N3-15
    { _: "仕", K: { つか_える: "Serve, Work For" }, O: ["し", "じ"], R: 439, C: ["人", "士"], T: ["N3", "N3-15"] },
    { _: "職", K: { _: "Employment" }, O: ["しょく"], R: 305, C: [], T: ["N3", "N3-15"] },
    { _: "求", K: { もと_める: "Demand, Request" }, O: ["きゅう"], R: 220, C: [], T: ["N3", "N3-15"] },
    { _: "探", K: { さぐ_る: "Explore", さが_す: "Search For" }, O: ["たん"], R: 930, C: [], T: ["N3", "N3-15"] },
    
    { _: "常", K: { つね: "Regular, Ordinary", とこ: "" }, O: ["じょう"], R: 293, C: ["龸"], T: ["N3", "N3-15"] },
    { _: "識", K: { _: "Discriminating, Knowledge" }, O: ["しき"], R: 496, C: ["言", "音", "戈"], T: ["N3", "N3-15"] },
    { _: "失", K: { うしな_う: "Lose, Forfeit" }, O: ["しつ"], R: 447, T: ["N3", "N3-15"] },
    { _: "礼", K: { _: "Salute, Bow" }, O: ["れい", "らい"], R: 1185, C: [], T: ["N3", "N3-15"] },
    
    { _: "労", K: { _: "Labor, Toil" }, O: ["ろう"], R: 398, C: [], T: ["N3", "N3-15"] },
    { _: "員", K: { _: "Staff" }, O: ["いん"], R: 54, C: ["口", "貝"], T: ["N3", "N3-15", "People"] },
    { _: "官", K: { _: "Bureaucrat" }, O: ["かん"], R: 230, T: ["N3", "N3-15", "People"] },
    { _: "局", K: { _: "Station, Bureau, Office" }, O: ["きょく"], R: 286, C: ["口"], T: ["N3", "N3-15"] },
    
    { _: "辞", K: { や_める: "Quit" }, O: ["じ"], R: 633, C: ["舌", "辛"], T: ["N3", "N3-15"] },
    { _: "退", K: { _: "Retreat, Resign", しりぞ_く: "Step Back", しりぞ_ける: "Refuse" }, O: ["たい"], R: 424, C: ["⻌", "艮"], T: ["N3", "N3-15"] },
    { _: "積", K: { _: "Volume, Multiplication", つ_む: "Load", つ_もる: "Accumulate" }, O: ["せき"], R: 541, C: ["禾", "貝"], T: ["N3", "N3-15"] },
    
    { _: "給", K: { _: "Wage, Gift" }, O: ["きゅう"], R: 615, C: ["糸", "合"], T: ["N3", "N3-15"] },
    { _: "収", K: { おさ_める: "Settle, Fit", おさ_まる: "" }, O: ["しゅう"], R: 337, C: [], T: ["N3", "N3-15"] },
    { _: "支", K: { ささ_える: "Support" }, O: ["し"], R: 159, C: ["十", "又"], T: ["N3", "N3-15"] },
    { _: "厚", K: { あつ_い: "Thick, Rich" }, O: ["こう"], R: 768, C: [], T: ["N3", "N3-15"] },
    // #endregion
    
    // #region Kanji N3-16
    { _: "議", K: { _: "Deliberation, Consulation" }, O: ["ぎ"], R: 25, C: ["言", "王", "我"], T: ["N3", "N3-16"] },
    { _: "賛", K: { _: "Approve, Praise" }, O: ["さん"], R: 868, C: [], T: ["N3", "N3-16"] },
    { _: "反", K: { そ_る: "Warp", そ_らす: "Bend" }, O: ["はん", "ほん", "たん"], R: 191, C: [], T: ["N3", "N3-16"] },
    { _: "対", K: { _: "Opposite, Versus" }, O: ["たい", "つい"], R: 34, C: [], T: ["N3", "N3-16"] },
    
    { _: "肯", K: { _: "Agreement, Consent" }, O: ["こう"], R: 1813, C: [], T: ["N3", "N3-16"] },
    { _: "否", K: { いな: "No, Refuse" }, O: ["ひ"], R: 561, C: [], T: ["N3", "N3-16"] },
    { _: "保", K: { たも_つ: "Keep, Preserve" }, O: ["ほ"], R: 146, C: ["人", "口", "木"], T: ["N3", "N3-16"] },
    { _: "留", K: { と_まる: "Detain, Halt" }, O: ["りゅう", "る"], R: 731, C: [], T: ["N3", "N3-16"] },
    
    { _: "判", K: { _: "Judgement" }, O: ["はん", "ばん"], R: 197, C: [], T: ["N3", "N3-16"] },
    { _: "断", K: { た_つ: "Sever", ことわ_る: "Decline, Refuse" }, O: ["だん"], R: 338, C: [], T: ["N3", "N3-16"] },
    { _: "確", K: { たし_か: "Certainly", たし_かめる: "Verify, Confirm" }, O: ["かく"], R: 252, C: ["石", "隹"], T: ["N3", "N3-16"] },
    { _: "認", K: { みと_める: "Acknowledge" }, O: ["にん"], R: 198, C: [], T: ["N3", "N3-16"] },
    
    { _: "報", K: { むく_いる: "Reward, Remunerate" }, O: ["ほう"], R: 167, C: [], T: ["N3", "N3-16"] },
    { _: "告", K: { つ_げる: "Tell, Inform" }, O: ["こく"], R: 188, C: [], T: ["N3", "N3-16"] },
    { _: "連", K: { つ_れる: "Take Along, Bring", つら_なる: "Be Connected", つら_ねる: "Link Together" }, O: ["れん"], R: 30, C: ["⻌", "車"], T: ["N3", "N3-16"] },
    { _: "絡", K: { から_む: "", から_まる: "Get Tangled", から_める: "Entangle" }, O: ["らく"], R: 806, C: ["糸", "夂", "口"], T: ["N3", "N3-16"] },
    
    { _: "相", K: { あい: "Mutual, Together" }, O: ["そう", "しょう"], R: 45, C: [], T: ["N3", "N3-16"] },
    { _: "談", K: { _: "Discuss" }, O: ["だん"], R: 272, C: [], T: ["N3", "N3-16"] },
    { _: "指", K: { さ_す: "Point", ゆび: "Finger" }, O: ["し"], R: 155, C: [], T: ["N3", "N3-16"] },
    { _: "示", K: { しめ_す: "Show, Indicate" }, O: ["じ", "し"], R: 237, T: ["N3", "N3-16"] },
    // #endregion
    
    // #region Kanji N3-17
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-17"] },
    // #endregion
    
    // #region Kanji N3-18
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3", "N3-18"] },
    // #endregion

    // #region Unlearned Kanji (N3)
    { _: "未", K: { いま_だ: "Still, Not Yet", ま_だ: ""  }, O: ["み"], R: 650, C: ["木"], T: ["N3"] },
    { _: "更", K: { さら_に: "Furthermore", ふ_ける: "Get Late", ふ_かす: "Stay Up Late" }, O: ["こう"], R: 861, T: ["N3"] },
    { _: "許", K: { ゆる_す: "Forgive", もと: "Allow" }, O: ["きょ"], R: 720, C: ["言", "午"], T: ["N3"] },
    { _: "争", K: { あらそ_う: "Compete, Dispute" }, O: ["そう"], R: 271, T: ["N3"] },
    { _: "敗", K: { やぶ_れる: "Defeated" }, O: ["はい"], R: 516, C: ["貝", "攵"], T: ["N3"] },
    { _: "過", K: { す_ぎる: "Too Much", す_ごす: "Spend" }, O: ["か"], R: 285, T: ["N3"] },
    { _: "与", K: { あた_える: "Bestow" }, O: ["よ"], R: 308, C: ["丂"], T: ["N3"] },
    { _: "昔", K: { むかし: "Long Ago, Ancient" }, O: ["せき", "しゃく"], R: 1197, C: ["龷", "日"], T: ["N3", "Time"] },
    { _: "居", K: { い_る: "Exist" }, O: ["きょ", "こ"], R: 836, C: ["尸", "古"], T: ["N3"] },
    { _: "遊", K: { あそ_ぶ: "Play" }, O: ["ゆう", "ゆ"], R: 941, C: ["⻌", "方", "子"], T: ["N3"] },
    { _: "費", K: { _: "Cost", つい_やす: "Spend" }, O: ["ひ"], R: 321, C: ["貝"], T: ["N3"] },
    { _: "絶", K: { _: "Discontinue, Sever", た_える: "End", た_やす: "", た_つ: "" }, O: ["ぜつ"], R: 784, C: ["糸", "色"], T: ["N3"] },
    { _: "最", K: { もっと_も: "Most" }, O: ["さい", "しゅ"], R: 82, C: ["日", "耳", "又"], T: ["N3"] },
    { _: "制", K: { _: "Limit, Rule" }, O: ["せい"], R: 108, C: ["刀"], T: ["N3"] },
    { _: "限", K: { かぎ_る: "Limited" }, O: ["げん"], R: 405, C: ["⻏", "艮"], T: ["N3"] },
    { _: "財", K: { _: "Property, Wealth" }, O: ["ざい", "さい", "ぞく"], R: 494, C: ["貝"], T: ["N3"] },
    { _: "両", K: { _: "Old Coin, Both" }, O: ["りょう"], R: 247, C: ["冂", "山"], T: ["N3"] },
    { _: "商", K: { あきな_う: "Trade" }, O: ["しょう"], R: 413, C: ["立", "冂", "儿", "口"], T: ["N3"] },
    { _: "刻", K: { きざ_む: "Engrave", きざ_み: "Increment, Notch" }, O: ["こく"], R: 866, C: ["刀"], T: ["N3"] },
    { _: "役", K: { _: "Role, Duty" }, O: ["やく", "えき"], R: 315, C: ["彳", "又"], T: ["N3"] },
    { _: "美", K: { うつく_しい: "Beautiful" }, O: ["び", "み"], R: 462, C: ["羊", "大"], T: ["N3"] },
    { _: "術", K: { _: "Technique" }, O: ["じゅつ"], R: 350, C: ["行"], T: ["N3"] },
    { _: "資", K: { _: "Assets, Resources" }, O: ["し"], R: 179, C: ["冫", "欠", "貝"], T: ["N3"] },
    { _: "髪", K: { かみ: "Hair (on head)" }, O: ["はつ"], R: 1474, C: ["長", "彡", "友"], T: ["N3"] },
    { _: "勤", K: { _: "Diligence", つと_める: "Serve", つと_まる: "Function Properly" }, O: ["きん", "ごん"], R: 830, C: ["力"], T: ["N3"] },
    { _: "訪", K: { おとず_れる: "Visit", たず_ねる: "" }, O: ["ほう"], R: 0, C: ["言", "方"], T: ["N3"] },
    { _: "参", K: { _: "Given Up", まい_る: "Go (Humble)" }, O: ["さん", "しん"], R: 201, C: ["厶", "彡"], T: ["N3"] },
    { _: "加", K: { くわ_える: "Add", くわ_わる: "Join" }, O: ["か"], R: 130, C: ["力", "口"], T: ["N3"] },
    { _: "放", K: { はな_す: "Let Go", ほう_る: "Throw, Fling", はな_つ: "Release", こ_く: "" }, O: ["ほう"], R: 288, C: ["方", "攵"], T: ["N3"] },
    { _: "民", K: { _: "People, Nation, Subjects" }, O: ["みん"], R: 28, C: ["氏"], T: ["N3"] },
    { _: "散", K: { ち_る: "Scatter", ち_らす: "Dissipate", ち_らかす: "Make a mess", ち_らかる: "Messy", ち_らばる: "Scattered" }, O: ["さん"], R: 758, C: ["月", "攵"], T: ["N3"] },
    { _: "非", K: { _: "Mistake, Negative" }, O: ["ひ"], R: 472, T: ["N3"] },
    { _: "現", K: { あらわ_れる: "Appear", あらわ_す: "Reveal" }, O: ["げん"], R: 85, C: ["王", "見"], T: ["N3"] },
    { _: "配", K: { くば_る: "Distribute" }, O: ["はい"], R: 359, C: ["已"], T: ["N3"] },
    { _: "祖", K: { _: "Ancestor" }, O: ["そ"], R: 1226, C: ["礻", "目"], T: ["N3"] },
    { _: "全", K: { まった_く: "Absolutely", すべ_て: "All" }, O: ["ぜん"], R: 75, C: ["王"], T: ["N3"] },
    { _: "景", K: { かげ: "Scenery, View" }, O: ["けい"], R: 419, C: ["日", "京"], T: ["N3", "Landscape"] },
    { _: "余", K: { あま_る: "Surplus, Excess", あま_す: "", あま_り: "Remainder" }, O: ["よ"], R: 680, C: ["人", "工", "小"], T: ["N3"] },
    { _: "眠", K: { ねむ_る: "Sleeping", ねむ_い: "Sleepy" }, O: ["みん"], R: 1315, C: ["目", "民"], T: ["N3"] },
    { _: "痛", K: { いた_い: "It Hurts", いた_ましい: "Painful" }, O: ["つう"], R: 903, C: ["疒", "用"], T: ["N3"] },
    { _: "険", K: { けわ_しい: "Steep (Place)" }, O: ["けん"], R: 707, C: ["⻏", "合", "人"], T: ["N3"] },
    { _: "越", K: { こ_す: "Move to", こ_える: "Get Over" }, O: ["えつ", "おつ"], R: 897, C: ["走", "戈"], T: ["N3"] },

    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N3"] },
    // #endregion

    // #region Unlearned Kanji (N2)
    { _: "営", K: { いとな_む: "Conduct (Business)" }, O: ["えい"], R: 303, C: ["龸", "呂"], T: ["N2"] },
    { _: "専", K: { もっぱ_ら: "Solely, Exclusively" }, O: ["せん"], R: 506, C: ["由", "寸"], T: ["N2"] },
    { _: "占", K: { し_める: "Occupy", うらな_う: "Fortune Telling" }, O: ["せん"], R: 694, C: ["卜", "口"], T: ["N2"] },
    { _: "簡", K: { _: "Simplicity, Brevity" }, O: ["かん", "けん"], R: 983, C: ["間"], T: ["N2"] },
    { _: "競", K: { きそ_う: "Compete", せ_る: "" }, O: ["きょう", "けい"], R: 610, C: ["立", "兄"], T: ["N2"] },
    { _: "協", K: { _: "Cooperation" }, O: ["きょう"], R: 121, C: ["十", "力"], T: ["N2"] },
    { _: "比", K: { くら_べる: "Compare" }, O: ["ひ"], R: 329, C: ["匕"], T: ["N2"] },
    { _: "瓶", K: { _: "Bottle" }, O: ["びん"], R: 1528, C: ["并", "瓦"], T: ["N2"] },
    { _: "宝", K: { たから: "Treasure" }, O: ["ほう"], R: 1139, C: ["王"], T: ["N2"] },
    { _: "算", K: { _: "Calculation" }, O: ["さん"], R: 361, T: ["N2"] },
    { _: "周", K: { _: "Circumference, Lap", まわ_り: "Surroundings" }, O: ["しゅう"], R: 562, C: ["冂", "土", "口"], T: ["N2"] },
    { _: "将", K: { _: "Commander" }, O: ["しょう", "そう"], R: 634, C: ["⺤", "寸"], T: ["N2"] },
    { _: "講", K: { _: "Lecture, Club" }, O: ["こう"], R: 653, C: ["言"], T: ["N2"] },
    { _: "蔵", K: { おさ_める: "To Store", かく_れる: "" }, O: ["ぞう", "そう"], R: 468, C: ["艹", "厂", "臣", "戈"], T: ["N2"] },
    { _: "臣", K: { _: "Retainer, Subject, Minister" }, O: ["しん", "じん"], R: 1249, T: ["N2"] },
    { _: "布", K: { ぬの: "Cloth" }, O: ["ふ", "ほ"], R: 877, C: ["巾"], T: ["N2"] },
    { _: "替", K: { か_える: "Replace", か_わる: "" }, O: ["たい"], R: 979, C: ["夫", "日"], T: ["N2"] },
    { _: "航", K: { _: "Sail, Cruise, Fly" }, O: ["こう"], R: 665, C: ["舟"], T: ["N2"] },
    { _: "郵", K: { _: "Mail" }, O: ["ゆう"], R: 917, C: ["垂", "⻏"], T: ["N2"] },
    { _: "技", K: { わざ: "Skill, Ability" }, O: ["ぎ"], R: 434, C: ["手", "支"], T: ["N2"] },
    { _: "帽", K: { _: "Hat" }, O: ["ぼう", "もう"], R: 1742, C: ["巾", "日", "目"], T: ["N2"] },
    { _: "禁", K: { _: "Prohibited" }, O: ["きん"], R: 681, C: ["木", "示"], T: ["N2"] },
    { _: "版", K: { _: "Printing Plate, Edition" }, O: ["はん"], R: 802, C: ["片", "厂", "又"], T: ["N2"] },
    { _: "片", K: { かた: "One-Sided, Sheet" }, O: ["へん"], R: 1076, T: ["N2"] },
    { _: "乱", K: { _: "Riot", みだ_れる: "Disturbed", みだ_す: "Disturb" }, O: ["らん", "ろん"], R: 755, C: ["舌"], T: ["N2"] },
    { _: "暴", K: { _: "Outburst", あば_く: "Expose", あば_れる: "Go Wild" }, O: ["ぼう", "ばく"], R: 692, T: ["N2"] },
    { _: "快", K: { こころよ_い: "Pleasant" }, O: ["かい"], R: 1074, C: ["心"], T: ["N2"] },
    { _: "辛", K: { から_い: "Spicy, Bitter" }, O: ["しん"], R: 1607, C: ["立", "十"], T: ["N2"] },
    { _: "軍", K: { _: "Army, Military" }, O: ["ぐん"], R: 189, C: ["車"], T: ["N2"] },
    { _: "訓", K: { _: "Instruction", おし_える: "Train", くん_ずる: "" }, O: ["くん", "きん"], R: 1134, C: ["言", "川"], T: ["N2"] },
    { _: "双", K: { _: "Pair" }, O: ["そう"], R: 1029, C: ["又"], T: ["N2"] },
    { _: "導", K: { みちび_く: "Lead, Guide" }, O: ["どう"], R: 354, C: ["道", "寸"], T: ["N2"] },
    { _: "紅", K: { くれない: "Crimson" }, O: ["こう", "く"], R: 1299, C: ["糸", "工"], T: ["N2"] },
    { _: "溶", K: { と_ける: "Melt", と_かす: "Dissolve" }, O: ["よう"], R: 1364, C: ["氵", "谷"], T: ["N2"] },
    { _: "灰", K: { はい: "Ashes" }, O: ["かい"], R: 1717, C: ["厂", "火"], T: ["N2"] },
    { _: "極", K: { きわ_める: "To Master", きわ_まる: "Ultimate" }, O: ["きょく", "ごく"], R: 460, C: ["木", "口", "又"], T: ["N2"] },
    { _: "駐", K: { _: "Stop-over" }, O: ["ちゅう"], R: 955, C: ["馬", "主"], T: ["N2"] },
    { _: "瓶", K: { _: "Bottle" }, O: ["びん"], R: 1528, C: ["瓦"], T: ["N2"] },

    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N2"] },
    // #endregion

    // #region Unlearned Kanji (N1)
    { _: "氏", K: { うじ: "Clan" }, O: ["し"], R: 84, T: ["N1", "People"] },
    { _: "価", K: { あたい: "Price, Value" }, O: ["か", "け"], R: 250, C: ["人"], T: ["N1"] },
    { _: "無", K: { な_い: "Nothing, None" }, O: ["む", "ぶ"], R: 274, C: ["火"], T: ["N1"] },
    { _: "視", K: { _: "Inspection", み_る: "Look At" }, O: ["し"], R: 362, C: ["礻", "見"], T: ["N1"] },
    { _: "義", K: { _: "Righteousness" }, O: ["ぎ"], R: 415, C: ["王", "我"], T: ["N1"] },
    { _: "阪", K: { さか: "Heights, Slope" }, O: ["はん"], R: 503, C: ["⻏", "厂", "又"], T: ["N1"] },
    { _: "士", K: { さむらい: "Official, Scholar" }, O: ["し"], R: 526, T: ["N1", "People"] },
    { _: "攻", K: { せ_める: "Attack" }, O: ["こう"], R: 532, C: ["工", "攵"], T: ["N1"] },
    { _: "弁", K: { _: "Valve, Dialect, Discrimination", わきま_える: "Discern" }, O: ["べん", "へん"], R: 619, T: ["N1"] },
    { _: "避", K: { よ_ける: "Avoid" }, O: ["ひ"], R: 756, C: ["⻌", "尸", "口", "辛"], T: ["N1"] },
    { _: "司", K: { _: "Director, Official", つかさど_る: "Govern" }, O: ["し"], R: 759, C: ["口"], T: ["N1", "People"] },
    { _: "紀", K: { _: "Chronicle, Geologic Period" }, O: ["き"], R: 780, C: ["糸", "已"], T: ["N1"] },
    { _: "博", K: { _: "Doctor, Esteemed" }, O: ["はく", "ばく"], R: 794, C: ["専"], T: ["N1", "People"] },
    { _: "我", K: { _: "Ego, I" }, O: ["が"], R: 829, C: ["手", "戈"], T: ["N1"] },
    { _: "街", K: { まち: "Boulevard, Town" }, O: ["がい", "かい"], R: 891, C: ["行", "土"], T: ["N1"] },
    { _: "慮", K: { おもんぱく_る: "Consider" }, O: ["りょ"], R: 916, C: ["思"], T: ["N1"] },
    { _: "賃", K: { _: "Fare, Fee, Rent, Wages" }, O: ["ちん"], R: 961, C: ["人", "王", "貝"], T: ["N1"] },
    { _: "至", K: { いた_る: "Climax, Attain" }, O: ["し"], R: 996, C: ["厶", "土"], T: ["N1"] },
    { _: "握", K: { にぎ_る: "Grip, Seize" }, O: ["あく"], R: 1003, C: ["手", "屋"], T: ["N1"] },
    { _: "銭", K: { ぜに: "Money" }, O: ["せん", "ぜん"], R: 1008, C: ["金", "戈"], T: ["N1"] },
    { _: "誕", K: { _: "Nativity" }, O: ["たん"], R: 1024, C: ["言", "廴", "正"], T: ["N1"] },
    { _: "典", K: { _: "Code, Ceremony, Rule" }, O: ["てん", "でん"], R: 1055, T: ["N1"] },
    { _: "免", K: { _: "Excuse, Dismissal", まぬか_れる: "Be Spared, Escape" }, O: ["めん"], R: 1080, T: ["N1"] },
    { _: "隆", K: { _: "High, Noble, Prosperity" }, O: ["りゅう"], R: 1109, C: ["⻏", "夂", "生"], T: ["N1"] },
    { _: "唱", K: { とな_える: "Recite, Chant" }, O: ["しょう"], R: 1123, C: ["口", "日"], T: ["N1"] },
    { _: "嫌", K: { きら_い: "Dislike", きら_う: "Hate", いや: "No" }, O: ["けん", "げん"], R: 1207, C: ["女"], T: ["N1"] },
    { _: "斉", K: { そろ_う: "Be In Harmony", ひと_しい: "Equal", ひと_しく: "Evenly" }, O: ["せい", "さい"], R: 1209, T: ["N1"] },
    { _: "砲", K: { _: "Gun, Cannon" }, O: ["ほう"], R: 1268, C: ["石", "已"], T: ["N1"] },
    { _: "矢", K: { や: "Arrow" }, O: ["し"], R: 1294, T: ["N1"] },
    { _: "猛", K: { _: "Fierce" }, O: ["もう"], R: 1301, C: ["犬", "子", "皿"], T: ["N1"] },
    { _: "穴", K: { あな: "Hollow, Hole" }, O: ["けつ"], R: 1366, C: ["宀", "儿"], T: ["N1"] },
    { _: "鑑", K: { _: "Specimen", かんが_みる: "Take Into Account" }, O: ["かん"], R: 1391, C: ["金", "臣", "皿"], T: ["N1"] },
    { _: "也", K: { _: "To Be (Classical)" }, O: ["や", "え"], R: 1404, T: ["N1"] },
    { _: "玄", K: { _: "Mysterious, Occult" }, O: ["げん"], R: 1409, C: ["亠", "幺"], T: ["N1"] },
    { _: "鏡", K: { かがみ: "Mirror" }, O: ["きょう", "けい"], R: 1506, C: ["金", "立", "見"], T: ["N1"] },
    { _: "魔", K: { _: "Witch, Evil Spirit" }, O: ["ま"], R: 1514, C: ["广", "", "木"], T: ["N1"] },
    { _: "鬼", K: { おに: "Ghost, Devil" }, O: ["き"], R: 1557, C: ["田", "儿", "厶"], T: ["N1"] },
    { _: "稚", K: { _: "Immature" }, O: ["ち", "じ"], R: 1560, C: ["禾", "隹"], T: ["N1"] },
    { _: "邪", K: { _: "Wicked, Wrong", よこし_ま: "Evil" }, O: ["じゃ"], R: 1612, C: ["牙", "⻏"], T: ["N1"] },
    { _: "履", K: { _: "Perform, Complete", は_く: "Wear, Put on (shoes)" }, O: ["り"], R: 1619, C: ["尸", "彳", "日", "夂"], T: ["N1"] },
    { _: "寸", K: { す: "Measurement, Inch", みき: "" }, O: ["すん"], R: 1669, T: ["N1", "Measures"] },
    { _: "昆", K: { _: "Descendants" }, O: ["こん"], R: 1688, C: ["日", "比"], T: ["N1"] },
    { _: "垂", K: { た_れる: "Drooping" }, O: ["すい"], R: 1720, T: ["N1"] },
    { _: "盲", K: { めくら: "Blind" }, O: ["もう"], R: 1767, C: ["目"], T: ["N1"] },
    { _: "炊", K: { た_く: "Cook, Boil" }, O: ["すい"], R: 1777, C: ["火", "欠"], T: ["N1"] },
    { _: "刀", K: { _: "Sharpness, Decisiveness, Division", かたな: "Sword" }, O: ["とう"], R: 1794, T: ["N1"] },
    { _: "弓", K: { ゆみ: "Bow" }, O: ["きゅう"], R: 1802, T: ["N1"] },
    { _: "舌", K: { した: "Tongue" }, O: ["ぜつ"], R: 1830, C: ["千", "口"], T: ["N1", "Body"] },
    { _: "瓦", K: { かわら: "Tile, Gram" }, O: ["が"], R: 1850, T: ["N1"] },
    { _: "羊", K: { ひつじ: "Sheep" }, O: ["よう"], R: 1852, T: ["N1", "Animals"] },
    { _: "又", K: { _: "Grasping", また: "Again" }, O: ["ゆう"], R: 1874, T: ["N1"] },
    { _: "殻", K: { から: "Husk, Nut Shell" }, O: ["かく", "こく", "ばい"], R: 1892, C: ["士", "殳"], T: ["N1"] },
    { _: "尺", K: { さし: "Unit of Measure, Foot" }, O: ["しゃく"], R: 1940, C: ["尸"], T: ["N1"] },
    { _: "胡", K: { なんぞ: "Barbarian, Foreign" }, O: ["う", "こ", "ご"], R: 1995, C: ["古", "月"], T: ["N1"] },
    { _: "呂", K: { _: "Spine, Backbone" }, O: ["ろ", "りょ"], R: 2055, T: ["N1", "Body"] },
    { _: "渓", K: { _: "Mountain Stream, Valley" }, O: ["けい"], R: 2063, C: ["氵", "⺤", "夫"], T: ["N1"] },
    { _: "藻", K: { も: "Seaweed, Algae" }, O: ["そう"], R: 2124, C: ["艹", "氵", "品", "木"], T: ["N1"] },
    { _: "椅", K: { _: "Chair" }, O: ["い"], R: 2245, C: ["木", "可"], T: ["N1"] },
    { _: "醤", K: { ひしお: "A kind of miso" }, O: ["しょう"], R: 2485, C: ["将"], T: ["N1"] },
    { _: "藁", K: { わら: "Straw" }, O: ["こう"], R: 2488, C: ["艹", "高", "木"], T: ["N1"] },
    { _: "箋", K: { _: "Paper, Label, Letter" }, O: ["せん"], R: 9999, C: ["竹", "戈"], T: ["N1"] },
    { _: "椒", K: { はじかみ: "Pepper" }, O: ["しょう"], R: 9999, C: ["木", "上", "小", "又"], T: ["N1"] },
    { _: "磁", K: { _: "Magnet, Porcelain" }, O: ["じ"], R: 1686, C: ["石", "幺"], T: ["N1"] },
    { _: "狩", K: { か_る: "Hunt, Gather", か_り: "", が_り: "" }, O: ["しゅ"], R: 1785, C: ["犬", "宀", "寸"], T: ["N1"] },
    { _: "烏", K: { からす: "Crow" }, O: ["う", "お"], R: 2042, C: ["火"], T: ["N1"] },
    { _: "殆", K: { ほとん_ど: "Mostly, Almost" }, O: ["たい", "さい"], R: 9999, C: ["歹", "台"], T: ["N1"] },
    { _: "鶏", K: { にわとり: "Chicken" }, O: ["けい"], R: 1901, C: ["⺤", "夫", "鳥"], T: ["N1"] },
    { _: "故", K: { _: "Happenstance" }, O: ["こ"], R: 612, C: ["十", "口", "攵"], T: ["N1"] },
    { _: "障", K: { さわ_る: "Obstruct" }, O: ["しょう"], R: 742, C: ["⻏", "立","早"], T: ["N1"] },
    { _: "亜", K: { つ_ぐ: "Next Rank, Come After" }, O: ["あ"], R: 1509, T: ["N1"] },
    { _: "証", K: { あかし: "Proof, Certificate" }, O: ["しょう"], R: 306, C: ["言", "正"], T: ["N1"] },
    { _: "狭", K: { せま_い: "Narrow", せば_める: "Make Narrow", せば_まる: "Be Made Narrow" }, O: ["きょう", "こう"], R: 1346, C: ["犬", "夫"], T: ["N1"] },
    { _: "撮", K: { と_る: "Take (Picture)", つま_む: "Pinch" }, O: ["さつ"], R: 1023, C: ["手", "最"], T: ["N1"] },
    { _: "描", K: { か_く: "Draw", えが_く: "" }, O: ["びょう"], R: 876, C: ["手", "草", "田"], T: ["N1"] },
    { _: "幹", K: { _: "Tree Trunk" }, O: ["かん"], R: 364, C: ["十", "日", "干"], T: ["N1"] },
    { _: "瓦", K: { かわら: "Tile, Earthenware" }, O: ["が"], R: 1850, T: ["N1"] },
    { _: "賑", K: { にぎ_やか: "Busy, Lively", にぎ_わい: "Bustling", にぎ_わす: "Enliven" }, O: ["貝", "辰"], R: 9999, C: [], T: ["N1"] },
    { _: "辰", K: { _: "Morning", たつ: "Dragon" }, O: ["しん", "じん"], R: 1600, T: ["N1"] },

    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: ["N1"] },
    // #endregion
    
    // #region Radicals
    { _: "尸", K: { _: "Corpse, Remains" }, O: ["し"] },
    { _: "廾", K: { _: "Two Hands" }, O: ["きょう", "く"] },
    { _: "儿", K: { _: "Legs, Person" } },
    { _: "耂", K: { _: "Old" }, O: ["おい"] },
    { _: "疒", K: { _: "Sickness" }, O: ["だく", "にゃく", "しう", "じょう", "しつ"] },
    { _: "⺤", K: { _: "Claw, Fingernail"}, O: ["つめ", "のつ"] },
    { _: "牙", K: { きば: "Fang", は: "" }, O: ["が", "げ"] },
    { _: "彡", K: { _: "Hair, Feather" }, O: ["さん", "せん"] },
    { _: "歹", K: { _: "Death, Bad, Wrong" }, O: ["がつ", "がち", "たい"] },
    
    { _: "厶", K: { _: "Private" }, O: ["し", "ぼう", "む"] },
    { _: "已", K: { _: "Self, Own" } },
    { _: "关", K: { _: "Relation" } },
    { _: "龷", K: { _: "Together" } },
    { _: "釆", K: { _: "Distinguishing, Separating" }, O: ["はん", "べん", "さい"] },

    { _: "卜", K: { _: "Divining" }, O: ["ぼく", "と"] },
    { _: "云", K: { い_う: "Say" }, O: ["うん"] },
    { _: "弋", K: { _: "Shoot" }, O: ["よく"] },
    { _: "并", K: { _: "Combine" }, O: ["へい", "ひょう"] },

    { _: "亠", K: { _: "Head, Above, Lid" }, O: ["とう"] },
    { _: "幺", K: { _: "Short, Tiny" }, O: ["よう"] },
    { _: "斗", K: { _: "Volume Measure" }, O: ["と", "とう"] },
    { _: "兀", K: { _: "High, Lofty" }, O: ["こつ"] },
    { _: "丂", K: { _: "Reach" }, O: ["こう"] },
    { _: "冂", K: { _: "Wide, Box, Wilderness" }, O: ["きょう", "けい"] },
    { _: "昜", K: { _: "Open, Lingering" }, O: ["よう"] },

    { _: "乍", K: { _: "Though, While, All" }, O: ["さ", "さく"] },
    { _: "勿", K: { _: "Not, Must Not" }, O: ["もち", "ぶつ", "ぼつ"] },
    { _: "々", K: { _: "Kanji Repetition" } },

    { _: "⻏", K: { _: "Village, Town, Hill" }, O: ["ゆう"] },
    { _: "宀", K: { _: "Roof, Cover" }, O: ["べん", "めん"] },
    { _: "卩", K: { _: "Seal" }, O: ["ふし", "せつ"] },
    { _: "广", K: { _: "House Built on Slope, Stony Cliff" }, O: ["げん"] },
    { _: "厂", K: { _: "Cliff" }, O: ["かん"] },
    { _: "礻", K: { _: "Altar, To Show" }, O: ["し"] },
    { _: "龸", K: { _: "Classroom" } },

    { _: "隹", K: { とり: "Small Bird" }, O: ["さい", "すい"] },
    { _: "豕", K: { ぶた: "Pig" }, O: ["し"] },
    { _: "彐", K: { _: "Snout, Pig's Head" }, O: ["けい"] },
    { _: "艹", K: { _: "Grass, Plant" }, O: ["くさ"] },
    { _: "禾", K: { のぎ: "Grain, Ear" }, O: ["か"] },

    { _: "艮", K: { _: "Good, Stopping" }, O: ["こん", "ごん"] },
    { _: "廴", K: { _: "Walking Long Distance" }, O: ["いん"] },
    { _: "⻌", K: { _: "Path, Going" } },
    { _: "彳", K: { _: "Step, Person Moving" }, O: ["てき"] },
    { _: "夂", K: { しゅう: "Late, Walking Slowly" }, O: ["ち"] },
    { _: "癶", K: { _: "Footsteps" }, O: ["はつ"] },

    { _: "冫", K: { _: "Cold, Ice" }, O: ["ひょう"] },
    { _: "氵", K: { _: "Water, Flowing" }, O: ["みず"] },
    { _: "几", K: { つくえ: "Wind, Table" }, O: ["き"] },

    { _: "斤", K: { _: "Axe" }, O: ["おの", "きん"] },
    { _: "攵", K: { _: "Whip, Strike" }, O: ["ほく"] },
    { _: "匕", K: { さじ: "Spoon" }, O: ["ひ"] },
    { _: "帚", K: { ほうき: "Broom" }, O: ["そう", "しゅう"] },
    { _: "戈", K: { ほこ: "Spear" }, O: ["か"] },
    { _: "殳", K: { また: "Halberd", ほこ: "" }, O: ["しゅ"] },

    { _: "罒", K: { _: "Net" }, O: ["もう", "ぼう"] },
    { _: "疋", K: { _: "Bolt of Cloth" }, O: ["ひき", "そう", "しょう", "ひつ"] },
    { _: "頁", K: { _: "Page, Leaf of a Book" }, O: ["けつ"] },
    { _: "巾", K: { _: "Towel, Hanging Scroll" }, O: ["きん", "ふく"] },
    { _: "衤", K: { ころも: "Clothing" } },
    // #endregion

    // _ = Kanji, K = Kunyomi (JP), O = Onyomi (CH), R = Frequency, C = Components, T = Tags
    // { _: "", K: { X: "" }, O: [""], R: 0, C: [], T: [""] },
];
