var kanji = [
    // #region Minna no Nihongo 0
    { _: "習", K: { なら_う: "To Learn", なら_い: "Habits" }, O: ["しゅう", "じゅ"], R: 706, C: ["羽", "白"], T: ["M-0"] },
    { _: "羽", K: { はね: "Feather, Wing", は: "" }, O: ["う"], R: 748, C: [ "冫" ] },
    { _: "冫", K: { _: "Cold, Ice" } },
    { _: "白", K: { しろ: "White", しろ_い: "", しら: "" }, O: ["はく", "びゃく"], R: 483 },

    { _: "練", K: { _: "Practice, Refine", ね_る: "Kneed", ね_り: "Kneeding" }, O: ["れん"], R: 788, C: ["糸", "東"], T: ["M-0"] },
    { _: "糸", K: { いと: "Thread" }, O: ["し"], R: 1488, C: ["幺", "小"] },
    { _: "幺", K: { _: "Short, Tiny" } },
    { _: "小", K: { ちい_さい: "Little, Small", こ: "", お: "", さ: "" }, O: ["しょう"], R: 114 },
    { _: "東", K: { ひがし: "East" }, O: ["どう"], R: 37, C: ["日", "木"] },
    { _: "日", K: { ひ: "Day, Sun", び: "", か: "" }, O: ["にち", "しつ"], R: 1 },
    { _: "木", K: { き: "Tree, Wood", こ: "" }, O: ["もく", "ぼく"], R: 317 },

    { _: "復", K: { また: "Restore, Resume" }, O: ["ふく"], R: 438, C: ["彳", "日", "夂"], T: ["M-0"] },
    { _: "彳", K: { _: "Person Moving" } },
    { _: "夂", K: { _: "Walking Slowly, Delayed" } },
    
    { _: "文", K: { _: "Sentence, Literature", ふみ: "", あや: "" }, O: ["ぶん", "もん"], R: 190, T: ["N4-6", "M-0"] },
    { _: "法", K: { のり: "Method, Law" }, O: ["ほう", "ぽう", "はっ", "ふらん"], R: 100, C: ["氵", "去"], T: ["M-0"] },
    { _: "氵", K: { _: "Water, Flowing" } },
    { _: "土", K: { つち: "Soil, Ground" }, O: ["ど", "と"], R: 307 },
    { _: "厶", K: { _: "Self, Private" } },
    
    { _: "単", K: { ひとえ: "Simple, Single" }, O: ["たん"], R: 586, C: ["小", "田", "十"], T: ["M-0"] },
    { _: "田", K: { た: "Rice Field" }, O: ["でん"], R: 90 },
    { _: "十", K: { とお: "Ten" }, O: ["じゅう"], R: 8 },
    { _: "語", K: { _: "Language", かた_る: "Talk", かた_らう: "" }, O: ["ご"], R: 301, C: ["言", "五"], T: ["N4-6", "M-0"] },
    { _: "言", K: { い_う: "Say", こと: "Word" }, O: ["げん", "ごん"], R: 83, C: ["口"] },
    { _: "口", K: { くち: "Mouth, Opening" }, O: ["こう", "く"], R: 284 },
    { _: "五", K: { いつ: "Five" }, O: ["ご"], R: 31 },

    { _: "発", K: { た_つ: "Depart", あば_く: "", つか_わす: "Emit" }, O: ["はつ", "ほつ"], R: 32, C: ["癶", "儿"], T: ["M-0"] },
    { _: "癶", K: { はつ: "Footsteps" } },
    { _: "儿", K: { _: "Legs, Person" } },
    { _: "音", K: { おと: "Sound", ね: "" }, O: ["おん", "いん"], R: 491, C: ["立", "日"], T: ["M-0"] },
    { _: "立", K: { た_つ: "Stand", た_ち: "", た_てる: "" }, O: ["りつ", "りゅう", "りっとつ"], R: 58 },
    
    { _: "名", K: { な: "Name, Reputation" }, O: ["めい", "みょう"], R: 177, C: ["", "口"], T: ["M-0"] },
    { _: "夕", K: { ゆう: "Evening" }, O: ["せき"], R: 924 },
    { _: "詞", K: { ことば: "Part of Speech" }, O: ["し"], R: 1636, C: ["言", "司"], T: ["M-0"] },
    { _: "司", K: { _: "Director, Official", つかさど_る: "Govern" }, O: ["し"], R: 759, C: ["口"] },
    
    { _: "動", K: { うご_く: "Move", うご_かす: "" }, O: ["どう"], R: 73, C: ["重", "力"], T: ["M-0"] },
    { _: "重", K: { おも_い: "Heavy, Important", おも_り: "Weight", かさ_なる: "Overlap", かさ_ねる: "Layer" }, O: ["じゅう", "ちょう"], R: 193 },
    { _: "力", K: { ちから: "Power, Strength" }, O: ["りょく", "りき"], R: 62 },
    // #endregion

    // #region Kanji N4-1
    { _: "家", K: { いえ: "House, Family", うち: "", や: "Professional, Expert" }, O: ["か", "け"], R: 133, C: ["宀", "豕"], T: ["N4-1"] },
    { _: "豕", K: { _: "Pig" } },
    { _: "族", K: { つぎ: "Tribe, Family" }, O: ["ぞく"], R: 393, C: ["方", "矢"], T: ["N4-1"] },
    { _: "兄", K: { あに: "Older Brother" }, O: ["けい", "きょく"], R: 1219, C: ["口", "儿"], T: ["N4-1"] },
    { _: "弟", K: { おとうと: "Younger Brother" }, O: ["てい", "だい"], R: 1161, C: ["弓"], T: ["N4-1"] },
    { _: "姉", K: { あね: "Older Sister" }, O: ["し"], R: 1473, C: ["女", "市"], T: ["N4-1"] },
    { _: "市", K: { いち: "Market, City" }, O: ["し"], R: 42 },
    { _: "妹", K: { いもうと: "Younger Sister" }, O: ["まい"], R: 1446, C: ["女", "未"], T: ["N4-1"] },
    { _: "私", K: { わたし: "I, Me" }, O: ["し"], R: 242, C: ["禾", "厶"], T: ["N4-1"] },
    { _: "育", K: { そだ_つ: "Grow Up", そだ_てる: "Raise" }, O: ["いく"], R: 369, C: ["厶", "月"], T: ["N4-1"] },
    
    { _: "部", K: { へ: "Section, Department" }, O: ["ぶ"], R: 36, C: ["立", "口", "⻏"], T: ["N4-1"] },
    { _: "⻏", K: { _: "Village, Town" } },
    { _: "屋", K: { や: "Roof, House, Shop" }, O: ["おく"], R: 616, C: ["尸", ], T: ["N4-1"] },
    { _: "至", K: { いた_る: "Climax, Attain" }, O: ["し"], R: 996, C: ["厶", "土"] },
    { _: "広", K: { ひろ_い: "Wide, Spacious", ひろ_まる: "Get Wider", ひろ_める: "Make Wider", ひろ_がる: "Spread", ひろ_げる: "" }, O: ["こう"], R: 263, C: ["厶"], T: ["N4-1"] },
    { _: "低", K: { ひく_い: "Lower, Short", ひく_まる: "Get Lower", ひく_める: "Make Lower" }, O: ["てい"], R: 435, C: ["人", "氏"], T: ["N4-1"] },
    { _: "氏", K: { うじ: "Clan" }, O: ["し"], R: 84 },
    { _: "近", K: { ちか_い: "Nearby, Early" }, O: ["きん", "こん"], R: 194, C: ["⻌", "斤"], T: ["N4-1"] },
    { _: "斤", K: { _: "Axe" } },
    { _: "⻌", K: { _: "Path, Going" } },
    { _: "遠", K: { とお_い: "Distant" }, O: ["えん", "おん"], R: 887, C: ["⻌", "土"], T: ["N4-1"] },
    { _: "静", K: { しず_か: "Quiet", しず_まる: "Get Quiet", しず_める: "Make Quiet" }, O: ["せい", "じょう"], R: 764, C: ["青", "争"], T: ["N4-1"] },
    { _: "青", K: { あお_い: "Blue" }, O: ["せい", "しょう"], R: 589, C: ["月"] },
    { _: "争", K: { あらそ_う: "Compete, Dispute" }, O: ["そう"], R: 271 },

    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-1"] },
    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-1"] },
    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-1"] },
    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-1"] },
    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-1"] },
    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-1"] },
    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-1"] },
    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-1"] },
    // #endregion

    // #region Kanji N4-2
    // { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-2"] },

    // #endregion
    
    // #region Kanji N4-3
    // { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-3"] },

    // #endregion
    
    // #region Kanji N4-4
    { _: "工", K: { もく: "Craft, Construction" }, O: ["こう", "く"], R: 299, T: ["N4-4"] },
    { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-4"] },
    // #endregion

    // #region Kanji N4-5
    // { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-5"] },

    // #endregion

    // #region Kanji N4-6
    { _: "研", K: { _: "Polish", と_ぐ: "Sharpen" }, O: ["けん"], R: 336, C: ["石", "廾"], T: ["N4-6"] },
    { _: "石", K: { いし: "Stone" }, O: ["せき", "しゃく", "こく"], R: 342, C: ["口"] },
    { _: "廾", K: { _: "Two Hands" } },
    { _: "究", K: { _: "Research", きわ_める: "Study" }, O: ["きゅう", "く"], R: 368, C: ["穴", "九"], T: ["N4-6"] },
    { _: "穴", K: { あな: "Hole, Cave" }, O: ["けつ"], R: 1366, C: ["宀", "儿"] },
    { _: "宀", K: { _: "Roof, Cover" } },
    { _: "九", K: { ここの: "Nine" }, O: ["きゅう", "く"], R: 55 },
    { _: "英", K: { はなぶさ: "English, Hero" }, O: ["えい"], R: 430, C: ["艹", "大"], T: ["N4-6"] },
    { _: "艹", K: { _: "Grass, Plant" } },
    { _: "大", K: { おお: "Large, Big", おお_きい: "", おお_いに: "" }, O: ["だい", "たい"], R: 7 },
    { _: "化", K: { ば_ける: "Disguise", か_する: "Convert Into" }, O: ["か", "け"], R: 89, C: ["人", "匕"], T: ["N4-6"] },
    { _: "人", K: { ひと: "Person", り: "", と: "" }, O: ["じん", "にん"], R: 5 },
    { _: "匕", K: { _: "Spoon" } },
    { _: "数", K: { かず: "Number", かぞ_える: "Count" }, O: ["すう"], R: 148, C: ["米", "女", "攵"], T: ["N4-6"] },
    { _: "米", K: { こめ: "Rice", よね: "" }, O: ["べい", "まい"], R: 61 },
    { _: "女", K: { おんな: "Woman, Female", め: "" }, O: ["じょ", "にょ"], R: 151 },
    { _: "攵", K: { _: "Whip" } },
    { _: "心", K: { こころ: "Heart, Spirit" }, O: ["しん"], R: 157, T: ["N4-6"] },

    { _: "若", K: { わか_い: "Young" }, O: ["しゃく"], R: 458, C: ["艹", "右"], T: ["N4-6"] },
    { _: "右", K: { みぎ: "Right" }, O: ["う", "こう"], R: 602, C: ["口"] },
    { _: "集", K: { あつ_まる: "Get Together", あつ_める: "Collect", つど_う: "Gather" }, O: ["しゅう"], R: 210, C: ["隹", "木"], T: ["N4-6"] },
    { _: "隹", K: { _: "Small Bird" } },
    { _: "知", K: { し_る: "Know", し_らせる: "Inform" }, O: ["ち"], R: 205, C: ["矢", "口"], T: ["N4-6"] },
    { _: "矢", K: { や: "Arrow" }, O: ["し"], R: 1294 },
    { _: "酒", K: { さけ: "Alcohol", さか: "" }, O: ["しゅ"], R: 1006, C: ["氵"], T: ["N4-6"] },
    { _: "歌", K: { うた_う: "Sing" }, O: ["か"], R: 519, C: ["可", "欠"], T: ["N4-6"] },
    { _: "可", K: { べ_き: "Can, Approval", べ_し: "" }, O: ["か"], R: 314, C: ["口"] },
    { _: "欠", K: { _: "Yawning", か_ける: "Chipped", か_く: "Lacking" }, O: ["けつ", "けん"], R: 860, C: [] },
    { _: "声", K: { こえ: "Voice", こわ: "" }, O: ["せい", "しょう"], R: 388, C: ["士", "尸"], T: ["N4-6"] },
    { _: "士", K: { さむらい: "Official, Scholar" }, O: ["し"], R: 526 },
    { _: "尸", K: { _: "Corpse, Remains" } },
    { _: "楽", K: { たの_しい: "Fun", たの_しむ: "Enjoy" }, O: ["がく", "らく"], R: 373, C: ["冫", "白", "木"], T: ["N4-6"] },

    { _: "味", K: { あじ: "Taste, Flavor", あじ_わう: "" }, O: ["み"], R: 442, C: ["口", "未"], T: ["N4-6"] },
    { _: "未", K: { いま_だ: "Still, Not Yet", ま_だ: ""  }, O: ["み"], R: 650, C: ["木"] },
    { _: "油", K: { あぶら: "Oil" }, O: ["ゆ", "ゆう"], R: 690, C: ["氵", "由"], T: ["N4-6"] },
    { _: "由", K: { よし: "Wherefore, A Reason", よ_る: "By" }, O: ["ゆ", "ゆう", "ゆい"], R: 325, C: ["田"] },
    { _: "太", K: { ふと_い: "Thick", ふと_る: "Gain Weight" }, O: ["たい", "た"], R: 552, C: ["大"], T: ["N4-6"] },
    { _: "細", K: { ほそ_い: "Thin", ほそ_る: "Get Thinner", こま_かい: "Fine" }, O: ["さい"], R: 537, C: ["糸", "田"], T: ["N4-6"] },
    { _: "皿", K: { さら: "Dish, Plate" }, O: ["べい"], R: 1812, T: ["N4-6"] },
    { _: "飯", K: { めし: "Meal" }, O: ["はん"], R: 1046, C: ["食", "又"], T: ["N4-6"] },
    { _: "食", K: { た_べる: "Eat" }, O: ["しょく"], R: 328 },
    { _: "又", K: { また: "Furthermore" }, O: ["ゆう"], R: 1874 },
    { _: "麦", K: { むぎ: "Wheat, Barley" }, O: ["ばく"], R: 1615, C: ["夂"], T: ["N4-6"] },
    // #endregion

    // #region Kanji N4-7
    { _: "春", K: { はる: "Spring" }, O: ["しゅん"], R: 579, C: ["日"], T: ["N4-7"] },
    { _: "夏", K: { なつ: "Summer" }, O: ["か"], R: 659, C: ["夂"], T: ["N4-7"] },
    { _: "秋", K: { あき: "Autumn", とき: "" }, O: ["しゅう"], R: 635, C: ["禾", "火"], T: ["N4-7"] },
    { _: "禾", K: { _: "Grain, Ear" } },
    { _: "冬", K: { ふゆ: "Winter" }, O: ["とう"], R: 1090, C: ["夂", "冫"], T: ["N4-7"] },
    { _: "空", K: { そら: "Sky", あ_く: "Vacant", あ_き: "", あ_ける: "", から: "Emptiness" }, O: ["くう"], R: 304, C: [], T: ["N4-7"] },
    { _: "穴", K: { あな: "Hollow, Hole" }, O: ["けつ"], R: 1366, C: ["宀", "儿"] },
    { _: "星", K: { ほし: "Star" }, O: ["せい", "しょう"], R: 844, C: ["日", "生"], T: ["N4-7"] },
    { _: "雲", K: { くも: "Cloud" }, O: ["うん"], R: 1256, C: ["雨", "云"], T: ["N4-7"] },
    { _: "云", K: { _: "Say" } },
    { _: "去", K: { さ_る: "Leave, Depart" }, O: ["きょ", "こ"], R: 440, C: ["土", "厶"], T: ["N4-7"] },

    { _: "天", K: { あまつ: "Heaven, Imperial" }, O: ["てん"], R: 512, C: ["大"], T: ["N4-7"] },
    { _: "晴", K: { は_れる: "Sunny", は_らす: "Clear" }, O: ["せい"], R: 1022, C: ["日", "月"], T: ["N4-7"] },
    { _: "雪", K: { ゆき: "ゆき" }, O: ["せつ"], R: 1131, C: ["雨", "彐"], T: ["N4-7"] },
    { _: "彐", K: { _: "Snout, Pig's Head" }, O: ["けい"] },
    { _: "風", K: { かぜ: "Wind, Air, Style" }, O: ["ふう"], R: 558, C: ["几", "虫"], T: ["N4-7"] },
    { _: "几", K: { _: "Table, Wind Radical" } },
    { _: "強", K: { つよ_い: "Strong", つよ_まる: "Get Stronger", つよ_める: "Make Stronger" }, O: ["きょう", "ごう"], R: 112, C: ["弓", "厶", "虫"], T: ["N4-7"] },
    { _: "弓", K: { ゆみ: "Bow" }, O: ["きゅう"], R: 1802 },
    { _: "弱", K: { よわ_い: "Weak, Frail", よわ_まる: "Get Weaker", よわ_める: "Make Weaker" }, O: ["じゃく"], R: 958, C: ["弓", "冫"], T: ["N4-7"] },
    { _: "暑", K: { あつ_い: "Hot" }, O: ["しょ"], R: 1442, C: ["日", "者"], T: ["N4-7"] },
    { _: "者", K: { もの: "Someone, Person" }, O: ["しゃ"], R: 38, C: ["耂", "日"] },
    { _: "耂", K: { _: "Old" } },
    { _: "寒", K: { さむ_い: "Cold" }, O: ["かん"], R: 1456, C: "冫", T: ["N4-7"] },
    
    { _: "旅", K: { たび: "Journey, Travel" }, O: ["リョ"], R: 783, C: ["方"], T: ["N4-7"] },
    { _: "方", K: { かた: "Direction, Person" }, O: ["ほう"], R: 46 },
    { _: "持", K: { も_つ: "Hold, Have" }, O: ["じ"], R: 119, C: ["扌", "寺"], T: ["N4-7"] },
    { _: "扌", K: { _: "Hand" } },
    { _: "寺", K: { てら: "Temple" }, O: ["じ"], R: 879, C: ["土", "寸"] },
    { _: "寸", K: { す: "Measurement, Inch", みき: "" }, O: ["すん"], R: 1669 },
    { _: "世", K: { よ: "World, Society, Generation" }, O: ["せい", "せ"], R: 135, T: ["N4-7"] },
    { _: "界", K: { _: "World, Boundary" }, O: ["かい"], R: 158, C: ["田"], T: ["N4-7"] },
    { _: "写", K: { うつ_す: "Copy", うつ_る: "Photograph" }, O: ["しゃ"], R: 453, T: ["N4-7"] },
    { _: "真", K: { ま: "True", まこと: "" }, O: ["しん"], R: 279, C: ["目"], T: ["N4-7"] },
    { _: "目", K: { め: "Eye" }, O: ["もく", "ぼく"], R: 76 },
    { _: "船", K: { ふね: "Boat (Large)" }, O: ["せん"], R: 713, C: ["舟", "八", "口"], T: ["N4-7"] },
    { _: "舟", K: { ふね: "Boat (Small)" }, O: ["しゅう"], R: 1786 },
    { _: "八", K: { や: "Eight, Divide", や_つ: "", よう: "" }, O: ["はち", "はつ"], R: 92 },
    // #endregion

    // #region Kanji N4-8
    // { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-8"] },
    // #endregion

    // #region Kanji N4-9
    // { _: "", K: { X: "" }, O: [], R: 0, C: [], T: ["N4-9"] },
    // #endregion

    // #region Untagged, Known Kanji
    // { _: "合", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "中", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "通", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "居", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "屋", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "本", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "飲", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "手", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "校", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "話", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "洋", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "見", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "料", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "平", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "長", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "明", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "昼", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "茶", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "子", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    { _: "生", K: { い_きる: "Live", い_ける: "Living", い_かす: "Make Use Of", う_まれる: "Born", な_る: "", う_む: "Give Birth", は_える: "Grow", なま: "Raw",  }, O: ["せい", "しょう"], R: 29, T: [] },
    { _: "雨", K: { あめ: "Rain" }, O: ["う"], R: 950, T: [] },
    { _: "月", K: { つき: "Moon, Month" }, O: ["がつ","げつ"], R: 23, T: [] },
    { _: "虫", K: { むし: "Insect" }, O: ["ちゅう", "き"], R: 1351, C: ["中"], T: [] },
    // #endregion

    // #region Untagged, Unknown Kanji
    // { _: "識", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "運", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "転", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "鼻", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "鳴", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "勝", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "器", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "調", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "意", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "醤", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "陽", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "取", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "灰", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "炊", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "器", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "粉", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "藁", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // { _: "帽", K: { X: "" }, O: [], R: 0, C: [], T: [] },
    // #endregion

    // _ = Kanji, K = Kunyomi (JP), O = Onyomi (CH), R = Frequency, C = Components, T = Tags
    // { _: "", K: { X: "" }, O: [], R: 0, C: [], T: [] },
];
